burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
/*!
    \file    gd32m53x_gptimer.c
    \brief   GPTIMER driver

    \version 2026-03-04, V1.0.0, firmware for GD32M53x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32m53x_gptimer.h"

/* GPTIMER init parameter mask */
#define REGISTER_WRITER_PROTECT_MASK      ((uint32_t)0x0000000FU)     /*!< GPTIMER register write protect definitions */
#define DMA_REQUEST_ENABLE_MASK           ((uint32_t)0x007F0000U)     /*!< GPTIMER DMA request enable definitions */
#define OUTPUT_LEVEL_MASK                 ((uint32_t)0x00000003U)     /*!< GPTIMER output level definitions */
#define COMPARISON_GENERATE_TRIGGER_MASK  ((uint32_t)0x0000F000U)     /*!< GPTIMER comparison match generate trigger definitions */
#define TRIGGER_ADC_SKIPPING_VALUE_MASK   ((uint32_t)0x0000000FU)     /*!< GPTIMER trigger adc skipping value definitions */
#define TRIGGER_ADD_SKIPPING_VALUE_MASK   ((uint32_t)0x0000000FU)     /*!< GPTIMER trigger add skipping value definitions */
#define COUNTER_SYNC_RESET_SOURCE_MASK    ((uint32_t)0x000100CFU)     /*!< GPTIMER counter sync reset source definitions */
#define SKIPPING_TIME_MASK                ((uint32_t)0x00000007U)     /*!< GPTIMER skipping time definitions */
#define FLOW_SKIPPING_LINK_MASK           ((uint32_t)0x0000300FU)     /*!< GPTIMER flow interrupt skipping link definitions */
#define INTERRUPT_ENABLE_MASK             ((uint32_t)0x000080BFU)     /*!< GPTIMER interrupt enable definitions */
#define INTERRUPT_FLAG_MASK               ((uint32_t)0x000080BFU)     /*!< GPTIMER interrupt flag definitions */

/*!
    \brief      deinit GPTIMER (API_ID(0x0001U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_deinit(uint32_t timer_periph)
{
    switch(timer_periph) {
    case GPTIMER0:
        /* reset GPTIMER0 */
        rcu_periph_reset_enable(RCU_GPTIMER0RST);
        rcu_periph_reset_disable(RCU_GPTIMER0RST);
        break;
    case GPTIMER1:
        /* reset GPTIMER1 */
        rcu_periph_reset_enable(RCU_GPTIMER1RST);
        rcu_periph_reset_disable(RCU_GPTIMER1RST);
        break;
    default:
        break;
    }
}

/*!
    \brief      initialize GPTIMER init parameter struct with a default value (API_ID(0x0002U))
    \param[in]  initpara: init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_struct_para_init(gptimer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        initpara->clock_source      = GPTIMER_CLOCK_SOURCE_CK_GPTIMER;
        initpara->clock_polarity    = GPTIMER_CLOCK_POLARITY_RISING;
        initpara->prescaler         = 0U;
        initpara->alignedmode       = GPTIMER_COUNTER_EDGE;
        initpara->counterdirection  = GPTIMER_COUNTER_UP;
        initpara->period            = 65535U;
        initpara->clockdivision     = GPTIMER_CKDIV_DIV1;
        initpara->repetitioncounter = 0U;
    }
}

/*!
    \brief      initialize GPTIMER counter (API_ID(0x0003U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  initpara: init parameter struct
                  clock_source: GPTIMER_CLOCK_SOURCE_CK_GPTIMER, GPTIMER_CLOCK_SOURCE_ETI0, GPTIMER_CLOCK_SOURCE_ETI1, GPTIMER_CLOCK_SOURCE_ETI2
                                GPTIMER_CLOCK_SOURCE_ETI3
                  clock_polarity: GPTIMER_CLOCK_POLARITY_RISING, GPTIMER_CLOCK_POLARITY_FALLING, GPTIMER_CLOCK_POLARITY_BOTH
                  prescaler: prescaler value of the counter clock, 0~65535
                  alignedmode: GPTIMER_COUNTER_EDGE, GPTIMER_COUNTER_CENTER
                  counterdirection: GPTIMER_COUNTER_UP, GPTIMER_COUNTER_DOWN
                  period: counter auto reload value, 0~65535
                  clockdivision: GPTIMER_CKDIV_DIV1, GPTIMER_CKDIV_DIV2, GPTIMER_CKDIV_DIV4
                  repetitioncounter: counter repetition value, 0~4095
    \param[out] none
    \retval     none
*/
void gptimer_init(uint32_t timer_periph, gptimer_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_CTL0(timer_periph) &= (~(uint32_t)(GPTIMER_CTL0_CKSSEL | GPTIMER_CTL0_CKESEL));
        GPTIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clock_source & GPTIMER_CTL0_CKSSEL);
        GPTIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clock_polarity & GPTIMER_CTL0_CKESEL);

        /* configure the counter prescaler value */
        GPTIMER_PSC(timer_periph) = (uint16_t)initpara->prescaler;

