burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
        /* configure the counter direction and aligned mode */
        GPTIMER_CTL0(timer_periph) &= (~(uint32_t)(GPTIMER_CTL0_DIR | GPTIMER_CTL0_CAM));

        GPTIMER_CTL0(timer_periph) |= (uint32_t)((initpara->counterdirection & GPTIMER_CTL0_DIR) | GPTIMER_CTL0_FDIR);
        GPTIMER_CTL0(timer_periph) &= (~(uint32_t)(GPTIMER_CTL0_FDIR));

        GPTIMER_CTL0(timer_periph) |= (uint32_t)(initpara->alignedmode & GPTIMER_CTL0_CAM);

        GPTIMER_CTL0(timer_periph) &= (~(uint32_t)GPTIMER_CTL0_CKDIV);
        GPTIMER_CTL0(timer_periph) |= (uint32_t)(initpara->clockdivision & GPTIMER_CTL0_CKDIV);
        /* configure the autoreload value */
        GPTIMER_CAR(timer_periph) = (uint32_t)initpara->period;
        /* configure the repetition counter value */
        GPTIMER_CREP(timer_periph) &= ~(uint32_t)(GPTIMER_CREP_CREP);
        GPTIMER_CREP(timer_periph) |= (uint32_t)(initpara->repetitioncounter & GPTIMER_CREP_CREP);
        /* generate an update event */
        switch(timer_periph) {
        case GPTIMER0:
            GPTIMER_RSSEL(timer_periph) |= GPTIMER_RSSEL_SWRSTCNT;
            GPTIMER_SWRST(timer_periph) |= (uint32_t)GPTIMER_SWRST_GPTIMER0SWRST;
            break;
        case GPTIMER1:
            GPTIMER_RSSEL(timer_periph) |= GPTIMER_RSSEL_SWRSTCNT;
            GPTIMER_SWRST(timer_periph) |= (uint32_t)GPTIMER_SWRST_GPTIMER1SWRST;
            break;
        default:
            break;
        }
    }
}

/*!
    \brief      enable GPTIMER register write protect function (API_ID(0x0004U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  register_protect:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_WRITE_PROTECT_SWEN: GPTIMER_SWEN register writer protect
      \arg        GPTIMER_WRITE_PROTECT_SWDIS: GPTIMER_SWDIS register writer protect
      \arg        GPTIMER_WRITE_PROTECT_SWRST: GPTIMER_SWRST register writer protect
      \arg        GPTIMER_WRITE_PROTECT_OTHER: other register writer protect
    \param[out] none
    \retval     none
*/
void gptimer_register_write_protect_enable(uint32_t timer_periph, uint32_t register_protect)
{
    GPTIMER_WP(timer_periph) = (uint32_t)((register_protect & REGISTER_WRITER_PROTECT_MASK) | (uint32_t)(0xA5 << 8));
}

/*!
    \brief      disable GPTIMER register write protect function (API_ID(0x0005U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  register_protect:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_WRITE_PROTECT_SWEN: GPTIMER_SWEN register writer protect
      \arg        GPTIMER_WRITE_PROTECT_SWDIS: GPTIMER_SWDIS register writer protect
      \arg        GPTIMER_WRITE_PROTECT_SWRST: GPTIMER_SWRST register writer protect
      \arg        GPTIMER_WRITE_PROTECT_OTHER: other register writer protect
    \param[out] none
    \retval     none
*/
void gptimer_register_write_protect_disable(uint32_t timer_periph, uint32_t register_protect)
{
    GPTIMER_WP(timer_periph) = ~(uint32_t)((register_protect & REGISTER_WRITER_PROTECT_MASK) | (uint32_t)(~(0xA5 << 8)));

}

/*!
    \brief      select a GPTIMER clock source (API_ID(0x0006U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  clock_source:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CLOCK_SOURCE_CK_GPTIMER: select CK_GPTIMER as clock source
      \arg        GPTIMER_CLOCK_SOURCE_ETI0: select ETI0 as clock source
      \arg        GPTIMER_CLOCK_SOURCE_ETI1: select ETI1 as clock source
      \arg        GPTIMER_CLOCK_SOURCE_ETI2: select ETI2 as clock source
      \arg        GPTIMER_CLOCK_SOURCE_ETI3: select ETI3 as clock source
    \param[out] none
    \retval     none
*/
void gptimer_clock_source_select(uint32_t timer_periph, uint32_t clock_source)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)(GPTIMER_CTL0_CKSSEL);
    GPTIMER_CTL0(timer_periph) |= (uint32_t)(clock_source & GPTIMER_CTL0_CKSSEL);

}

/*!
    \brief      configure a GPTIMER clock polarity (API_ID(0x0007U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  clock_polarity:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CLOCK_POLARITY_RISING: select rising edge as clock polarity
      \arg        GPTIMER_CLOCK_POLARITY_FALLING: select falling edge as clock polarity
      \arg        GPTIMER_CLOCK_POLARITY_BOTH: select both edge as clock polarity
    \param[out] none
    \retval     none
*/
void gptimer_clock_polarity_config(uint32_t timer_periph, uint32_t clock_polarity)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)(GPTIMER_CTL0_CKESEL);
    GPTIMER_CTL0(timer_periph) |= (uint32_t)(clock_polarity & GPTIMER_CTL0_CKESEL);
}

/*!
    \brief      software enable GPTIMER counter (API_ID(0x0008U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  timer_cnt:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER0_COUNT: GPTIMER0 counter
      \arg        GPTIMER1_COUNT: GPTIMER1 counter
    \param[out] none
    \retval     none
*/
void gptimer_counter_software_enable(uint32_t timer_periph, uint32_t timer_cnt)
{
    GPTIMER_SWEN(timer_periph) |= (uint32_t)timer_cnt;
}

/*!
    \brief      software disable GPTIMER counter (API_ID(0x0009U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  timer_cnt:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER0_COUNT: GPTIMER0 counter
      \arg        GPTIMER1_COUNT: GPTIMER1 counter
    \param[out] none
    \retval     none
*/
void gptimer_counter_software_disable(uint32_t timer_periph, uint32_t timer_cnt)
{
    GPTIMER_SWDIS(timer_periph) |= (uint32_t)timer_cnt;
}

/*!
    \brief      software reset GPTIMER counter (API_ID(0x000AU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  timer_cnt:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER0_COUNT: GPTIMER0 counter
      \arg        GPTIMER1_COUNT: GPTIMER1 counter
    \param[out] none
    \retval     none
*/
void gptimer_counter_software_reset(uint32_t timer_periph, uint32_t timer_cnt)
{
    GPTIMER_SWRST(timer_periph) |= (uint32_t)timer_cnt;
}

/*!
    \brief      initialize GPTIMER counter enable source init parameter struct with a default value (API_ID(0x000BU))
    \param[in]  counter_enable_source_para: counter enable source init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_counter_enable_source_struct_para_init(gptimer_counter_enable_source_parameter_struct
                                                    *counter_enable_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(counter_enable_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x000BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        counter_enable_source_para->enable_source_eti0 = GPTIMER_ETI0_TRG_DISABLE;
        counter_enable_source_para->enable_source_eti1 = GPTIMER_ETI1_TRG_DISABLE;
        counter_enable_source_para->enable_source_eti2 = GPTIMER_ETI2_TRG_DISABLE;
        counter_enable_source_para->enable_source_eti3 = GPTIMER_ETI3_TRG_DISABLE;
        counter_enable_source_para->enable_source_ch0 =  GPTIMER_CH0_TRG_DISABLE;
        counter_enable_source_para->enable_source_ch1 =  GPTIMER_CH1_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel0 = GPTIMER_EVSEL0_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel1 = GPTIMER_EVSEL1_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel2 = GPTIMER_EVSEL2_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel3 = GPTIMER_EVSEL3_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel4 = GPTIMER_EVSEL4_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel5 = GPTIMER_EVSEL5_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel6 = GPTIMER_EVSEL6_TRG_DISABLE;
        counter_enable_source_para->enable_source_evsel7 = GPTIMER_EVSEL7_TRG_DISABLE;
        counter_enable_source_para->enable_source_software = GPTIMER_SOFTWARE_TRG_DISABLE;
    }
}

/*!
    \brief      initialize GPTIMER counter enable source (API_ID(0x000CU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  counter_enable_source_para: counter enable source init parameter struct
                  enable_source_eti0: GPTIMER_ETI0_TRG_DISABLE, GPTIMER_ETI0_TRG_EDGE_RISING, GPTIMER_ETI0_TRG_EDGE_FALLING, GPTIMER_ETI0_TRG_EDGE_BOTH
                  enable_source_eti1: GPTIMER_ETI1_TRG_DISABLE, GPTIMER_ETI1_TRG_EDGE_RISING, GPTIMER_ETI1_TRG_EDGE_FALLING, GPTIMER_ETI1_TRG_EDGE_BOTH
                  enable_source_eti2: GPTIMER_ETI2_TRG_DISABLE, GPTIMER_ETI2_TRG_EDGE_RISING, GPTIMER_ETI2_TRG_EDGE_FALLING, GPTIMER_ETI2_TRG_EDGE_BOTH
                  enable_source_eti3: GPTIMER_ETI3_TRG_DISABLE, GPTIMER_ETI3_TRG_EDGE_RISING, GPTIMER_ETI3_TRG_EDGE_FALLING, GPTIMER_ETI3_TRG_EDGE_BOTH
                  enable_source_ch0: GPTIMER_CH0_TRG_DISABLE, GPTIMER_CH0_TRG_EDGE_RISING, GPTIMER_CH0_TRG_EDGE_FALLING, GPTIMER_CH0_TRG_EDGE_BOTH
                  enable_source_ch1: GPTIMER_CH1_TRG_DISABLE, GPTIMER_CH1_TRG_EDGE_RISING, GPTIMER_CH1_TRG_EDGE_FALLING, GPTIMER_CH1_TRG_EDGE_BOTH
                  enable_source_evsel0: GPTIMER_EVSEL0_TRG_DISABLE, GPTIMER_EVSEL0_TRG_ENABLE
                  enable_source_evsel1: GPTIMER_EVSEL1_TRG_DISABLE, GPTIMER_EVSEL1_TRG_ENABLE
                  enable_source_evsel2: GPTIMER_EVSEL2_TRG_DISABLE, GPTIMER_EVSEL2_TRG_ENABLE
                  enable_source_evsel3: GPTIMER_EVSEL3_TRG_DISABLE, GPTIMER_EVSEL3_TRG_ENABLE
                  enable_source_evsel4: GPTIMER_EVSEL4_TRG_DISABLE, GPTIMER_EVSEL4_TRG_ENABLE
                  enable_source_evsel5: GPTIMER_EVSEL5_TRG_DISABLE, GPTIMER_EVSEL5_TRG_ENABLE
                  enable_source_evsel6: GPTIMER_EVSEL6_TRG_DISABLE, GPTIMER_EVSEL6_TRG_ENABLE
                  enable_source_evsel7: GPTIMER_EVSEL7_TRG_DISABLE, GPTIMER_EVSEL7_TRG_ENABLE
                  enable_source_software: GPTIMER_SOFTWARE_TRG_DISABLE, GPTIMER_SOFTWARE_TRG_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_counter_enable_source_config(uint32_t timer_periph,
                                          gptimer_counter_enable_source_parameter_struct *counter_enable_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(counter_enable_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x000CU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_ESSEL(timer_periph) = (uint32_t)((uint32_t)(counter_enable_source_para->enable_source_eti0 & GPTIMER_ESSEL_ETI0ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_eti1 & GPTIMER_ESSEL_ETI1ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_eti2 & GPTIMER_ESSEL_ETI2ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_eti3 & GPTIMER_ESSEL_ETI3ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_ch0 & GPTIMER_ESSEL_CH0ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_ch1 & GPTIMER_ESSEL_CH1ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel0 & GPTIMER_ESSEL_EVSEL0ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel1 & GPTIMER_ESSEL_EVSEL1ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel2 & GPTIMER_ESSEL_EVSEL2ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel3 & GPTIMER_ESSEL_EVSEL3ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel4 & GPTIMER_ESSEL_EVSEL4ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel5 & GPTIMER_ESSEL_EVSEL5ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel6 & GPTIMER_ESSEL_EVSEL6ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_evsel7 & GPTIMER_ESSEL_EVSEL7ENCNT) |
                                                 (uint32_t)(counter_enable_source_para->enable_source_software & GPTIMER_ESSEL_SWENCNT));
    }
}

/*!
    \brief      initialize GPTIMER counter disable source init parameter struct with a default value (API_ID(0x000DU))
    \param[in]  counter_disable_source_para: counter disable source init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_counter_disable_source_struct_para_init(gptimer_counter_disable_source_parameter_struct
                                                     *counter_disable_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(counter_disable_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x000DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        counter_disable_source_para->disable_source_eti0 = GPTIMER_ETI0_TRG_DISABLE;
        counter_disable_source_para->disable_source_eti1 = GPTIMER_ETI1_TRG_DISABLE;
        counter_disable_source_para->disable_source_eti2 = GPTIMER_ETI2_TRG_DISABLE;
        counter_disable_source_para->disable_source_eti3 = GPTIMER_ETI3_TRG_DISABLE;
        counter_disable_source_para->disable_source_ch0 = GPTIMER_CH0_TRG_DISABLE;
        counter_disable_source_para->disable_source_ch1 = GPTIMER_CH1_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel0 = GPTIMER_EVSEL0_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel1 = GPTIMER_EVSEL1_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel2 = GPTIMER_EVSEL2_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel3 = GPTIMER_EVSEL3_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel4 = GPTIMER_EVSEL4_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel5 = GPTIMER_EVSEL5_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel6 = GPTIMER_EVSEL6_TRG_DISABLE;
        counter_disable_source_para->disable_source_evsel7 = GPTIMER_EVSEL7_TRG_DISABLE;
        counter_disable_source_para->disable_source_software = GPTIMER_SOFTWARE_TRG_DISABLE;
    }
}

/*!
    \brief      initialize GPTIMER counter disable source (API_ID(0x000EU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  counter_disable_source_para: counter disable source init parameter struct
                  disable_source_eti0: GPTIMER_ETI0_TRG_DISABLE, GPTIMER_ETI0_TRG_EDGE_RISING, GPTIMER_ETI0_TRG_EDGE_FALLING, GPTIMER_ETI0_TRG_EDGE_BOTH
                  disable_source_eti1: GPTIMER_ETI1_TRG_DISABLE, GPTIMER_ETI1_TRG_EDGE_RISING, GPTIMER_ETI1_TRG_EDGE_FALLING, GPTIMER_ETI1_TRG_EDGE_BOTH
                  disable_source_eti2: GPTIMER_ETI2_TRG_DISABLE, GPTIMER_ETI2_TRG_EDGE_RISING, GPTIMER_ETI2_TRG_EDGE_FALLING, GPTIMER_ETI2_TRG_EDGE_BOTH
                  disable_source_eti3: GPTIMER_ETI3_TRG_DISABLE, GPTIMER_ETI3_TRG_EDGE_RISING, GPTIMER_ETI3_TRG_EDGE_FALLING, GPTIMER_ETI3_TRG_EDGE_BOTH
                  disable_source_ch0: GPTIMER_CH0_TRG_DISABLE, GPTIMER_CH0_TRG_EDGE_RISING, GPTIMER_CH0_TRG_EDGE_FALLING, GPTIMER_CH0_TRG_EDGE_BOTH
                  disable_source_ch1: GPTIMER_CH1_TRG_DISABLE, GPTIMER_CH1_TRG_EDGE_RISING, GPTIMER_CH1_TRG_EDGE_FALLING, GPTIMER_CH1_TRG_EDGE_BOTH
                  disable_source_evsel0: GPTIMER_EVSEL0_TRG_DISABLE, GPTIMER_EVSEL0_TRG_ENABLE
                  disable_source_evsel1: GPTIMER_EVSEL1_TRG_DISABLE, GPTIMER_EVSEL1_TRG_ENABLE
                  disable_source_evsel2: GPTIMER_EVSEL2_TRG_DISABLE, GPTIMER_EVSEL2_TRG_ENABLE
                  disable_source_evsel3: GPTIMER_EVSEL3_TRG_DISABLE, GPTIMER_EVSEL3_TRG_ENABLE
                  disable_source_evsel4: GPTIMER_EVSEL4_TRG_DISABLE, GPTIMER_EVSEL4_TRG_ENABLE
                  disable_source_evsel5: GPTIMER_EVSEL5_TRG_DISABLE, GPTIMER_EVSEL5_TRG_ENABLE
                  disable_source_evsel6: GPTIMER_EVSEL6_TRG_DISABLE, GPTIMER_EVSEL6_TRG_ENABLE
                  disable_source_evsel7: GPTIMER_EVSEL7_TRG_DISABLE, GPTIMER_EVSEL7_TRG_ENABLE
                  disable_source_software: GPTIMER_SOFTWARE_TRG_DISABLE, GPTIMER_SOFTWARE_TRG_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_counter_disable_source_config(uint32_t timer_periph,
                                           gptimer_counter_disable_source_parameter_struct *counter_disable_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(counter_disable_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x000EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_DSSEL(timer_periph) = (uint32_t)((uint32_t)(counter_disable_source_para->disable_source_eti0 & GPTIMER_DSSEL_ETI0DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_eti1 & GPTIMER_DSSEL_ETI1DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_eti2 & GPTIMER_DSSEL_ETI2DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_eti3 & GPTIMER_DSSEL_ETI3DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_ch0 & GPTIMER_DSSEL_CH0DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_ch1 & GPTIMER_DSSEL_CH1DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel0 & GPTIMER_DSSEL_EVSEL0DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel1 & GPTIMER_DSSEL_EVSEL1DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel2 & GPTIMER_DSSEL_EVSEL2DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel3 & GPTIMER_DSSEL_EVSEL3DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel4 & GPTIMER_DSSEL_EVSEL4DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel5 & GPTIMER_DSSEL_EVSEL5DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel6 & GPTIMER_DSSEL_EVSEL6DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_evsel7 & GPTIMER_DSSEL_EVSEL7DISCNT) |
                                                 (uint32_t)(counter_disable_source_para->disable_source_software & GPTIMER_DSSEL_SWDISCNT));
    }
}

/*!
    \brief      initialize GPTIMER counter reset source init parameter struct with a default value (API_ID(0x000FU))
    \param[in]  counter_reset_source_para: counter reset source init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_counter_reset_source_struct_para_init(gptimer_counter_reset_source_parameter_struct
                                                   *counter_reset_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(counter_reset_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x000FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        counter_reset_source_para->reset_source_eti0 = GPTIMER_ETI0_TRG_DISABLE;
        counter_reset_source_para->reset_source_eti1 = GPTIMER_ETI1_TRG_DISABLE;
        counter_reset_source_para->reset_source_eti2 = GPTIMER_ETI2_TRG_DISABLE;
        counter_reset_source_para->reset_source_eti3 = GPTIMER_ETI3_TRG_DISABLE;
        counter_reset_source_para->reset_source_ch0 = GPTIMER_CH0_TRG_DISABLE;
        counter_reset_source_para->reset_source_ch1 = GPTIMER_CH1_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel0 = GPTIMER_EVSEL0_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel1 = GPTIMER_EVSEL1_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel2 = GPTIMER_EVSEL2_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel3 = GPTIMER_EVSEL3_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel4 = GPTIMER_EVSEL4_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel5 = GPTIMER_EVSEL5_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel6 = GPTIMER_EVSEL6_TRG_DISABLE;
        counter_reset_source_para->reset_source_evsel7 = GPTIMER_EVSEL7_TRG_DISABLE;
        counter_reset_source_para->reset_source_com_cap_sync = GPTIMER_RESET_SOURCE_DISABLE;
        counter_reset_source_para->reset_source_software = GPTIMER_SOFTWARE_TRG_DISABLE;
    }
}

