burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
/*!
    \brief      initialize GPTIMER counter reset source (API_ID(0x0010U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  counter_reset_source_para: counter reset source init parameter struct
                  reset_source_eti0: GPTIMER_ETI0_TRG_DISABLE, GPTIMER_ETI0_TRG_EDGE_RISING, GPTIMER_ETI0_TRG_EDGE_FALLING, GPTIMER_ETI0_TRG_EDGE_BOTH
                  reset_source_eti1: GPTIMER_ETI1_TRG_DISABLE, GPTIMER_ETI1_TRG_EDGE_RISING, GPTIMER_ETI1_TRG_EDGE_FALLING, GPTIMER_ETI1_TRG_EDGE_BOTH
                  reset_source_eti2: GPTIMER_ETI2_TRG_DISABLE, GPTIMER_ETI2_TRG_EDGE_RISING, GPTIMER_ETI2_TRG_EDGE_FALLING, GPTIMER_ETI2_TRG_EDGE_BOTH
                  reset_source_eti3: GPTIMER_ETI3_TRG_DISABLE, GPTIMER_ETI3_TRG_EDGE_RISING, GPTIMER_ETI3_TRG_EDGE_FALLING, GPTIMER_ETI3_TRG_EDGE_BOTH
                  reset_source_ch0: GPTIMER_CH0_TRG_DISABLE, GPTIMER_CH0_TRG_EDGE_RISING, GPTIMER_CH0_TRG_EDGE_FALLING, GPTIMER_CH0_TRG_EDGE_BOTH
                  reset_source_ch1: GPTIMER_CH1_TRG_DISABLE, GPTIMER_CH1_TRG_EDGE_RISING, GPTIMER_CH1_TRG_EDGE_FALLING, GPTIMER_CH1_TRG_EDGE_BOTH
                  reset_source_evsel0: GPTIMER_EVSEL0_TRG_DISABLE, GPTIMER_EVSEL0_TRG_ENABLE
                  reset_source_evsel1: GPTIMER_EVSEL1_TRG_DISABLE, GPTIMER_EVSEL1_TRG_ENABLE
                  reset_source_evsel2: GPTIMER_EVSEL2_TRG_DISABLE, GPTIMER_EVSEL2_TRG_ENABLE
                  reset_source_evsel3: GPTIMER_EVSEL3_TRG_DISABLE, GPTIMER_EVSEL3_TRG_ENABLE
                  reset_source_evsel4: GPTIMER_EVSEL4_TRG_DISABLE, GPTIMER_EVSEL4_TRG_ENABLE
                  reset_source_evsel5: GPTIMER_EVSEL5_TRG_DISABLE, GPTIMER_EVSEL5_TRG_ENABLE
                  reset_source_evsel6: GPTIMER_EVSEL6_TRG_DISABLE, GPTIMER_EVSEL6_TRG_ENABLE
                  reset_source_evsel7: GPTIMER_EVSEL7_TRG_DISABLE, GPTIMER_EVSEL7_TRG_ENABLE
                  reset_source_com_cap_sync: GPTIMER_RESET_SOURCE_DISABLE, GPTIMER_RESET_SOURCE_CH1CV_CMP_CAP, GPTIMER_RESET_SOURCE_CH0CV_CMP_CAP
                                        GPTIMER_RESET_SOURCE_CH1COMADD_CMP, GPTIMER_RESET_SOURCE_CH0COMADD_CMP, GPTIMER_RESET_SOURCE_SYNC_RESET
                  reset_source_software: GPTIMER_SOFTWARE_TRG_DISABLE, GPTIMER_SOFTWARE_TRG_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_counter_reset_source_config(uint32_t timer_periph,
                                         gptimer_counter_reset_source_parameter_struct *counter_reset_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(counter_reset_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0010U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_RSSEL(timer_periph) = (uint32_t)((uint32_t)(counter_reset_source_para->reset_source_eti0 & GPTIMER_RSSEL_ETI0RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_eti1 & GPTIMER_RSSEL_ETI1RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_eti2 & GPTIMER_RSSEL_ETI2RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_eti3 & GPTIMER_RSSEL_ETI3RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_ch0 & GPTIMER_RSSEL_CH0RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_ch1 & GPTIMER_RSSEL_CH1RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel0 & GPTIMER_RSSEL_EVSEL0RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel1 & GPTIMER_RSSEL_EVSEL1RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel2 & GPTIMER_RSSEL_EVSEL2RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel3 & GPTIMER_RSSEL_EVSEL3RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel4 & GPTIMER_RSSEL_EVSEL4RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel5 & GPTIMER_RSSEL_EVSEL5RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel6 & GPTIMER_RSSEL_EVSEL6RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_evsel7 & GPTIMER_RSSEL_EVSEL7RSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_com_cap_sync & GPTIMER_RSSEL_CSIRSTCNT) |
                                                 (uint32_t)(counter_reset_source_para->reset_source_software & GPTIMER_RSSEL_SWRSTCNT));
    }
}

/*!
    \brief      initialize GPTIMER counter up source init parameter struct with a default value (API_ID(0x0011U))
    \param[in]  counter_up_source_para: counter up source init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_counter_up_source_struct_para_init(gptimer_counter_up_source_parameter_struct *counter_up_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(counter_up_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0011U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        counter_up_source_para->up_count_source_eti0 = GPTIMER_ETI0_TRG_DISABLE;
        counter_up_source_para->up_count_source_eti1 = GPTIMER_ETI1_TRG_DISABLE;
        counter_up_source_para->up_count_source_eti2 = GPTIMER_ETI2_TRG_DISABLE;
        counter_up_source_para->up_count_source_eti3 = GPTIMER_ETI3_TRG_DISABLE;
        counter_up_source_para->up_count_source_ch0 = GPTIMER_CH0_TRG_DISABLE;
        counter_up_source_para->up_count_source_ch1 = GPTIMER_CH1_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel0 = GPTIMER_EVSEL0_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel1 = GPTIMER_EVSEL1_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel2 = GPTIMER_EVSEL2_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel3 = GPTIMER_EVSEL3_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel4 = GPTIMER_EVSEL4_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel5 = GPTIMER_EVSEL5_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel6 = GPTIMER_EVSEL6_TRG_DISABLE;
        counter_up_source_para->up_count_source_evsel7 = GPTIMER_EVSEL7_TRG_DISABLE;
    }
}

/*!
    \brief      initialize GPTIMER counter up source (API_ID(0x0012U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  counter_up_source_para: counter up source init parameter struct
                  up_count_source_eti0: GPTIMER_ETI0_TRG_DISABLE, GPTIMER_ETI0_TRG_EDGE_RISING, GPTIMER_ETI0_TRG_EDGE_FALLING, GPTIMER_ETI0_TRG_EDGE_BOTH
                  up_count_source_eti1: GPTIMER_ETI1_TRG_DISABLE, GPTIMER_ETI1_TRG_EDGE_RISING, GPTIMER_ETI1_TRG_EDGE_FALLING, GPTIMER_ETI1_TRG_EDGE_BOTH
                  up_count_source_eti2: GPTIMER_ETI2_TRG_DISABLE, GPTIMER_ETI2_TRG_EDGE_RISING, GPTIMER_ETI2_TRG_EDGE_FALLING, GPTIMER_ETI2_TRG_EDGE_BOTH
                  up_count_source_eti3: GPTIMER_ETI3_TRG_DISABLE, GPTIMER_ETI3_TRG_EDGE_RISING, GPTIMER_ETI3_TRG_EDGE_FALLING, GPTIMER_ETI3_TRG_EDGE_BOTH
                  up_count_source_ch0: GPTIMER_CH0_TRG_DISABLE, GPTIMER_CH0_TRG_EDGE_RISING, GPTIMER_CH0_TRG_EDGE_FALLING, GPTIMER_CH0_TRG_EDGE_BOTH
                  up_count_source_ch1: GPTIMER_CH1_TRG_DISABLE, GPTIMER_CH1_TRG_EDGE_RISING, GPTIMER_CH1_TRG_EDGE_FALLING, GPTIMER_CH1_TRG_EDGE_BOTH
                  up_count_source_evsel0: GPTIMER_EVSEL0_TRG_DISABLE, GPTIMER_EVSEL0_TRG_ENABLE
                  up_count_source_evsel1: GPTIMER_EVSEL1_TRG_DISABLE, GPTIMER_EVSEL1_TRG_ENABLE
                  up_count_source_evsel2: GPTIMER_EVSEL2_TRG_DISABLE, GPTIMER_EVSEL2_TRG_ENABLE
                  up_count_source_evsel3: GPTIMER_EVSEL3_TRG_DISABLE, GPTIMER_EVSEL3_TRG_ENABLE
                  up_count_source_evsel4: GPTIMER_EVSEL4_TRG_DISABLE, GPTIMER_EVSEL4_TRG_ENABLE
                  up_count_source_evsel5: GPTIMER_EVSEL5_TRG_DISABLE, GPTIMER_EVSEL5_TRG_ENABLE
                  up_count_source_evsel6: GPTIMER_EVSEL6_TRG_DISABLE, GPTIMER_EVSEL6_TRG_ENABLE
                  up_count_source_evsel7: GPTIMER_EVSEL7_TRG_DISABLE, GPTIMER_EVSEL7_TRG_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_counter_up_source_config(uint32_t timer_periph,
                                      gptimer_counter_up_source_parameter_struct *counter_up_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(counter_up_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0012U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_CUPEVSSEL(timer_periph) = (uint32_t)((uint32_t)(counter_up_source_para->up_count_source_eti0 & GPTIMER_CUPEVSSEL_ETI0CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_eti1 & GPTIMER_CUPEVSSEL_ETI1CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_eti2 & GPTIMER_CUPEVSSEL_ETI2CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_eti3 & GPTIMER_CUPEVSSEL_ETI3CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_ch0 & GPTIMER_CUPEVSSEL_CH0CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_ch1 & GPTIMER_CUPEVSSEL_CH1CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel0 & GPTIMER_CUPEVSSEL_EVSEL0CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel1 & GPTIMER_CUPEVSSEL_EVSEL1CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel2 & GPTIMER_CUPEVSSEL_EVSEL2CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel3 & GPTIMER_CUPEVSSEL_EVSEL3CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel4 & GPTIMER_CUPEVSSEL_EVSEL4CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel5 & GPTIMER_CUPEVSSEL_EVSEL5CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel6 & GPTIMER_CUPEVSSEL_EVSEL6CUPS) |
                                                     (uint32_t)(counter_up_source_para->up_count_source_evsel7 & GPTIMER_CUPEVSSEL_EVSEL7CUPS));
    }
}

/*!
    \brief      initialize GPTIMER counter down source init parameter struct with a default value (API_ID(0x0013U))
    \param[in]  counter_down_source_para: counter down source init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_counter_down_source_struct_para_init(gptimer_counter_down_source_parameter_struct
                                                  *counter_down_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(counter_down_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0013U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        counter_down_source_para->down_count_source_eti0 = GPTIMER_ETI0_TRG_DISABLE;
        counter_down_source_para->down_count_source_eti1 = GPTIMER_ETI1_TRG_DISABLE;
        counter_down_source_para->down_count_source_eti2 = GPTIMER_ETI2_TRG_DISABLE;
        counter_down_source_para->down_count_source_eti3 = GPTIMER_ETI3_TRG_DISABLE;
        counter_down_source_para->down_count_source_ch0 = GPTIMER_CH0_TRG_DISABLE;
        counter_down_source_para->down_count_source_ch1 = GPTIMER_CH1_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel0 = GPTIMER_EVSEL0_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel1 = GPTIMER_EVSEL1_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel2 = GPTIMER_EVSEL2_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel3 = GPTIMER_EVSEL3_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel4 = GPTIMER_EVSEL4_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel5 = GPTIMER_EVSEL5_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel6 = GPTIMER_EVSEL6_TRG_DISABLE;
        counter_down_source_para->down_count_source_evsel7 = GPTIMER_EVSEL7_TRG_DISABLE;
    }
}

/*!
    \brief      initialize GPTIMER counter down source (API_ID(0x0014U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  counter_down_source_para: counter down source init parameter struct
                  down_count_source_eti0: GPTIMER_ETI0_TRG_DISABLE, GPTIMER_ETI0_TRG_EDGE_RISING, GPTIMER_ETI0_TRG_EDGE_FALLING, GPTIMER_ETI0_TRG_EDGE_BOTH
                  down_count_source_eti1: GPTIMER_ETI1_TRG_DISABLE, GPTIMER_ETI1_TRG_EDGE_RISING, GPTIMER_ETI1_TRG_EDGE_FALLING, GPTIMER_ETI1_TRG_EDGE_BOTH
                  down_count_source_eti2: GPTIMER_ETI2_TRG_DISABLE, GPTIMER_ETI2_TRG_EDGE_RISING, GPTIMER_ETI2_TRG_EDGE_FALLING, GPTIMER_ETI2_TRG_EDGE_BOTH
                  down_count_source_eti3: GPTIMER_ETI3_TRG_DISABLE, GPTIMER_ETI3_TRG_EDGE_RISING, GPTIMER_ETI3_TRG_EDGE_FALLING, GPTIMER_ETI3_TRG_EDGE_BOTH
                  down_count_source_ch0: GPTIMER_CH0_TRG_DISABLE, GPTIMER_CH0_TRG_EDGE_RISING, GPTIMER_CH0_TRG_EDGE_FALLING, GPTIMER_CH0_TRG_EDGE_BOTH
                  down_count_source_ch1: GPTIMER_CH1_TRG_DISABLE, GPTIMER_CH1_TRG_EDGE_RISING, GPTIMER_CH1_TRG_EDGE_FALLING, GPTIMER_CH1_TRG_EDGE_BOTH
                  down_count_source_evsel0: GPTIMER_EVSEL0_TRG_DISABLE, GPTIMER_EVSEL0_TRG_ENABLE
                  down_count_source_evsel1: GPTIMER_EVSEL1_TRG_DISABLE, GPTIMER_EVSEL1_TRG_ENABLE
                  down_count_source_evsel2: GPTIMER_EVSEL2_TRG_DISABLE, GPTIMER_EVSEL2_TRG_ENABLE
                  down_count_source_evsel3: GPTIMER_EVSEL3_TRG_DISABLE, GPTIMER_EVSEL3_TRG_ENABLE
                  down_count_source_evsel4: GPTIMER_EVSEL4_TRG_DISABLE, GPTIMER_EVSEL4_TRG_ENABLE
                  down_count_source_evsel5: GPTIMER_EVSEL5_TRG_DISABLE, GPTIMER_EVSEL5_TRG_ENABLE
                  down_count_source_evsel6: GPTIMER_EVSEL6_TRG_DISABLE, GPTIMER_EVSEL6_TRG_ENABLE
                  down_count_source_evsel7: GPTIMER_EVSEL7_TRG_DISABLE, GPTIMER_EVSEL7_TRG_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_counter_down_source_config(uint32_t timer_periph,
                                        gptimer_counter_down_source_parameter_struct *counter_down_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(counter_down_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0014U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_CDNEVSSEL(timer_periph) = (uint32_t)((uint32_t)(counter_down_source_para->down_count_source_eti0 & GPTIMER_CDNEVSSEL_ETI0CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_eti1 & GPTIMER_CDNEVSSEL_ETI1CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_eti2 & GPTIMER_CDNEVSSEL_ETI2CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_eti3 & GPTIMER_CDNEVSSEL_ETI3CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_ch0 & GPTIMER_CDNEVSSEL_CH0CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_ch1 & GPTIMER_CDNEVSSEL_CH1CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel0 & GPTIMER_CDNEVSSEL_EVSEL0CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel1 & GPTIMER_CDNEVSSEL_EVSEL1CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel2 & GPTIMER_CDNEVSSEL_EVSEL2CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel3 & GPTIMER_CDNEVSSEL_EVSEL3CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel4 & GPTIMER_CDNEVSSEL_EVSEL4CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel5 & GPTIMER_CDNEVSSEL_EVSEL5CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel6 & GPTIMER_CDNEVSSEL_EVSEL6CDWS) |
                                                     (uint32_t)(counter_down_source_para->down_count_source_evsel7 & GPTIMER_CDNEVSSEL_EVSEL7CDWS));
    }
}

/*!
    \brief      select counter up input level source (API_ID(0x0015U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  input_source: counter up input level source
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_COUNTER_UP_DISABLE: counter up input source disable
      \arg        GPTIMER_COUNTER_UP_CH0_LOW: channel 0 low as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_CH0_HIGH: channel 0 high as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_CH1_LOW: channel 1 low as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_CH1_HIGH: channel 1 high as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI0_LOW: eti0 low as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI0_HIGH: eti0 high as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI1_LOW: eti1 low as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI1_HIGH: eti1 high as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI2_LOW: eti2 low as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI2_HIGH: eti2 high as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI3_LOW: eti3 low as counter up input source enable
      \arg        GPTIMER_COUNTER_UP_ETI3_HIGH: eti3 high as counter up input source enable
    \param[out] none
    \retval     none
*/
void gptimer_counter_up_input_level_source_select(uint32_t timer_periph, uint32_t input_source)
{
    GPTIMER_CUPEVSSEL(timer_periph) &= ~(uint32_t)(GPTIMER_CUPEVSSEL_INTLCUPS);
    GPTIMER_CUPEVSSEL(timer_periph) |= (uint32_t)(input_source & GPTIMER_CUPEVSSEL_INTLCUPS);
}

/*!
    \brief      select counter down input level source (API_ID(0x0016U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  input_source: counter down input level source
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_COUNTER_DOWN_DISABLE: counter down input source disable
      \arg        GPTIMER_COUNTER_DOWN_CH0_LOW: channel 0 low as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_CH0_HIGH: channel 0 high as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_CH1_LOW: channel 1 low as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_CH1_HIGH: channel 1 high as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI0_LOW: eti0 low as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI0_HIGH: eti0 high as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI1_LOW: eti1 low as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI1_HIGH: eti1 high as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI2_LOW: eti2 low as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI2_HIGH: eti2 high as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI3_LOW: eti3 low as counter down input source enable
      \arg        GPTIMER_COUNTER_DOWN_ETI3_HIGH: eti3 high as counter down input source enable
    \param[out] none
    \retval     none
*/
void gptimer_counter_down_input_level_source_select(uint32_t timer_periph, uint32_t input_source)
{
    GPTIMER_CDNEVSSEL(timer_periph) &= ~(uint32_t)(GPTIMER_CDNEVSSEL_INTLCDWS);
    GPTIMER_CDNEVSSEL(timer_periph) |= (uint32_t)(input_source & GPTIMER_CDNEVSSEL_INTLCDWS);
}

/*!
    \brief      enable GPTIMER (API_ID(0x0017U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_enable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) |= (uint32_t)GPTIMER_CTL0_CEN;
}

/*!
    \brief      disable GPTIMER (API_ID(0x0018U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_disable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)GPTIMER_CTL0_CEN;
}

/*!
    \brief      enable the auto reload shadow function (API_ID(0x0019U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_auto_reload_shadow_enable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) |= (uint32_t)GPTIMER_CTL0_ARSE;
}

/*!
    \brief      disable the auto reload shadow function (API_ID(0x001AU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_auto_reload_shadow_disable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)GPTIMER_CTL0_ARSE;
}

/*!
    \brief      enable the update event (API_ID(0x001BU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_update_event_enable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)GPTIMER_CTL0_UPDIS;
}

/*!
    \brief      disable the update event (API_ID(0x001CU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_update_event_disable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) |= (uint32_t) GPTIMER_CTL0_UPDIS;
}

/*!
    \brief      set counter alignment mode (API_ID(0x001DU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  aligned:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_COUNTER_EDGE: edge-aligned mode
      \arg        GPTIMER_COUNTER_CENTER: center-aligned mode
    \param[out] none
    \retval     none
*/
void gptimer_counter_alignment(uint32_t timer_periph, uint16_t aligned)
{
    GPTIMER_CTL0(timer_periph) &= (uint32_t)(~GPTIMER_CTL0_CAM);
    GPTIMER_CTL0(timer_periph) |= (uint32_t)(aligned & GPTIMER_CTL0_CAM);
}

/*!
    \brief      set counter up direction (API_ID(0x001EU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_counter_up_direction(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)GPTIMER_CTL0_DIR;
}

