burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
/*!
    \brief      set counter down direction (API_ID(0x001FU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_counter_down_direction(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) |= (uint32_t)GPTIMER_CTL0_DIR;
}

/*!
    \brief      enable counter direction force set (API_ID(0x0020U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_counter_direction_force_set_enable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) |= (uint32_t)GPTIMER_CTL0_FDIR;
}

/*!
    \brief      disable counter direction force set (API_ID(0x0021U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_counter_direction_force_set_disable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) &= ~(uint32_t)GPTIMER_CTL0_FDIR;
}

/*!
    \brief      select register global update source (API_ID(0x0022U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  source:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_GLOBAL_UPS_SEL_FLOW: global update event source select counter overflow / underflow event
      \arg        GPTIMER_GLOBAL_UPS_SEL_OVERFLOW: global update event source select counter overflow event
      \arg        GPTIMER_GLOBAL_UPS_SEL_UNDERFLOW: global update event source select counter underflow event
    \param[out] none
    \retval     none
*/
void gptimer_register_global_update_source_select(uint32_t timer_periph, uint32_t source)
{
    GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_GLBUPSEL;
    GPTIMER_UPSSEL(timer_periph) |= (uint32_t)(source & GPTIMER_UPSSEL_GLBUPSEL);
}

/*!
    \brief      select register local update source (API_ID(0x0023U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  reg:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_LOCAL_UP_CH0CV: CH0CV local update
      \arg        GPTIMER_LOCAL_UP_CH0COMV_ADD: CH0COMV_ADD local update
      \arg        GPTIMER_LOCAL_UP_CH1CV: CH1CV local update
      \arg        GPTIMER_LOCAL_UP_CH1COMV_ADD: CH1COMV_ADD local update
      \arg        GPTIMER_LOCAL_UP_ADCCR1: ADC triggered comparison value 1 local update
      \arg        GPTIMER_LOCAL_UP_ADCCR2: ADC triggered comparison value 2 local update
      \arg        GPTIMER_LOCAL_UP_CAR: car local update
      \arg        GPTIMER_LOCAL_UP_CH0: channel 0 output mode local update
      \arg        GPTIMER_LOCAL_UP_CH1: channel 1 output mode local update
    \param[in]  source:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_LOCAL_UPS_SEL_DISABLE: local update event source select disable
      \arg        GPTIMER_LOCAL_UPS_SEL_OVERFLOW: local update event source select counter overflow event
      \arg        GPTIMER_LOCAL_UPS_SEL_UNDERFLOW: local update event source select counter underflow event
      \arg        GPTIMER_LOCAL_UPS_SEL_FLOW: local update event source select counter flow event
      \arg        GPTIMER_LOCAL_UPS_SEL_CHCOM: local update event source select channel compare event(only GPTIMER_LOCAL_UP_CH0COMV_ADD
                                               and GPTIMER_LOCAL_UP_CH1COMV_ADD can be selected)
    \param[out] none
    \retval     none
*/
void gptimer_register_local_update_source_select(uint32_t timer_periph, uint32_t reg, uint32_t source)
{
    switch(reg) {
    case GPTIMER_LOCAL_UP_CH0CV:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CH0CVUPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)(source & GPTIMER_UPSSEL_CH0CVUPSEL);
        break;
    case GPTIMER_LOCAL_UP_CH0COMV_ADD:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CH0COMV_ADDUPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 2) & GPTIMER_UPSSEL_CH0COMV_ADDUPSEL);
        break;
    case GPTIMER_LOCAL_UP_CH1CV:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CH1CVUPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 5) & GPTIMER_UPSSEL_CH1CVUPSEL);
        break;
    case GPTIMER_LOCAL_UP_CH1COMV_ADD:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CH1COMV_ADDUPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 7) & GPTIMER_UPSSEL_CH1COMV_ADDUPSEL);
        break;
    case GPTIMER_LOCAL_UP_ADCCR1:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_ADCCR1UPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 10) & GPTIMER_UPSSEL_ADCCR1UPSEL);
        break;
    case GPTIMER_LOCAL_UP_ADCCR2:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_ADCCR1UPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 12) & GPTIMER_UPSSEL_ADCCR1UPSEL);
        break;
    case GPTIMER_LOCAL_UP_CAR:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CARUPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 14) & GPTIMER_UPSSEL_CARUPSEL);
        break;
    case GPTIMER_LOCAL_UP_CH0:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CH0UPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 24) & GPTIMER_UPSSEL_CH0UPSEL);
        break;
    case GPTIMER_LOCAL_UP_CH1:
        GPTIMER_UPSSEL(timer_periph) &= ~(uint32_t)GPTIMER_UPSSEL_CH1UPSEL;
        GPTIMER_UPSSEL(timer_periph) |= (uint32_t)((source << 26) & GPTIMER_UPSSEL_CH1UPSEL);
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief      configure prescaler (API_ID(0x0024U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  prescaler: prescaler value,0~65535
    \param[out] none
    \retval     none
*/
void gptimer_prescaler_config(uint32_t timer_periph, uint16_t prescaler)
{
    GPTIMER_PSC(timer_periph) = (uint32_t)prescaler;
}

/*!
    \brief      configure update repetition register value (API_ID(0x0025U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  repetition: the counter repetition value, 0~4095
    \param[in]  load_mode:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_UPREP_LOAD_IMMEDIATELY: repetition load immediately
      \arg        GPTIMER_UPREP_LOAD_NEXT_UPEVENT: repetition load at next update
    \param[out] none
    \retval     none
*/
void gptimer_update_repetition_value_config(uint32_t timer_periph, uint16_t repetition, uint32_t load_mode)
{
    GPTIMER_CREP(timer_periph) = (uint32_t)(repetition & GPTIMER_CREP_CREP);
    if(load_mode == GPTIMER_UPREP_LOAD_IMMEDIATELY) {
        GPTIMER_CREP(timer_periph) |= GPTIMER_CREP_RLD;
    }
}

/*!
    \brief      read update repetition register value (API_ID(0x0026U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     repetition value
*/
uint16_t gptimer_update_repetition_counter_read(uint32_t timer_periph)
{
    uint16_t repetition_counter = 0U;
    repetition_counter = (uint16_t)(((GPTIMER_CREP(timer_periph))&GPTIMER_CREP_CNT) >> 16);
    return repetition_counter;
}

/*!
    \brief      configure autoreload register value (API_ID(0x0027U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  autoreload: the counter auto-reload value,0~65535
    \param[out] none
    \retval     none
*/
void gptimer_autoreload_value_config(uint32_t timer_periph, uint32_t autoreload)
{
    GPTIMER_CAR(timer_periph) = (uint32_t)autoreload;
}

/*!
    \brief      configure counter register value (API_ID(0x0028U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  counter: the counter value, 0~65535
    \param[out] none
    \retval     none
*/
void gptimer_counter_value_config(uint32_t timer_periph, uint32_t counter)
{
    GPTIMER_CNT(timer_periph) = (uint32_t)counter;
}

/*!
    \brief      read counter value (API_ID(0x0029U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     counter value
*/
uint32_t gptimer_counter_read(uint32_t timer_periph)
{
    uint32_t count_value = 0U;
    count_value = GPTIMER_CNT(timer_periph);
    return count_value;
}

/*!
    \brief      read prescaler value (API_ID(0x002AU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     prescaler register value
*/
uint16_t gptimer_prescaler_read(uint32_t timer_periph)
{
    uint16_t prescaler_value = 0U;
    prescaler_value = (uint16_t)(GPTIMER_PSC(timer_periph));
    return prescaler_value;
}

/*!
    \brief      configure single pulse mode (API_ID(0x002BU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  spmode:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_SP_MODE_SINGLE: single pulse mode
      \arg        GPTIMER_SP_MODE_REPETITIVE: repetitive pulse mode
    \param[out] none
    \retval     none
*/
void gptimer_single_pulse_mode_config(uint32_t timer_periph, uint32_t spmode)
{
    if(GPTIMER_SP_MODE_SINGLE == spmode) {
        GPTIMER_CTL0(timer_periph) |= (uint32_t)GPTIMER_CTL0_SPM;
    } else if(GPTIMER_SP_MODE_REPETITIVE == spmode) {
        GPTIMER_CTL0(timer_periph) &= ~((uint32_t)GPTIMER_CTL0_SPM);
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      enable DMA (API_ID(0x002CU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  dma:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_DMA_CH0D:channel 0 capture or compare DMA request
      \arg        GPTIMER_DMA_CH1D: channel 1 capture or compare DMA request
      \arg        GPTIMER_DMA_CH0COMADD: channel 0 additional compare DMA request
      \arg        GPTIMER_DMA_CH1COMADD: channel 1 additional compare DMA request
      \arg        GPTIMER_DMA_REPED: repetition count end DMA request
      \arg        GPTIMER_DMA_OVERFLOWD: counter overflow DMA request
      \arg        GPTIMER_DMA_UNDERFLOWD: counter underflow DMA request
      \arg        GPTIMER_DMA_OVUNFLOWD: counter overflow/underflow DMA request
    \param[out] none
    \retval     none
*/
void gptimer_dma_enable(uint32_t timer_periph, uint32_t dma)
{
    GPTIMER_DMAINTEN(timer_periph) |= (uint32_t)(dma & DMA_REQUEST_ENABLE_MASK);
}

/*!
    \brief      disable DMA (API_ID(0x002DU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  dma:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_DMA_CH0D:channel 0 capture or compare DMA request
      \arg        GPTIMER_DMA_CH1D: channel 1 capture or compare DMA request
      \arg        GPTIMER_DMA_CH0COMADD: channel 0 additional compare DMA request
      \arg        GPTIMER_DMA_CH1COMADD: channel 1 additional compare DMA request
      \arg        GPTIMER_DMA_REPED: repetition count end DMA request
      \arg        GPTIMER_DMA_OVERFLOWD: counter overflow DMA request
      \arg        GPTIMER_DMA_UNDERFLOWD: counter underflow DMA request
      \arg        GPTIMER_DMA_OVUNFLOWD: counter overflow/underflow DMA request
    \param[out] none
    \retval     none
*/
void gptimer_dma_disable(uint32_t timer_periph, uint32_t dma)
{
    GPTIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(dma & DMA_REQUEST_ENABLE_MASK));
}

/*!
    \brief      configure the DMA transfer (API_ID(0x002EU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  dma_baseaddr:
                only one parameter can be selected which is shown as below:
       \arg        GPTIMER_DMACFG_DMATA_WP: DMA transfer address is GPTIMER_WP
       \arg        GPTIMER_DMACFG_DMATA_SWEN: DMA transfer address is GPTIMER_SWEN
       \arg        GPTIMER_DMACFG_DMATA_SWDIS: DMA transfer address is GPTIMER_SWDIS
       \arg        GPTIMER_DMACFG_DMATA_SWRST: DMA transfer address is GPTIMER_SWRST
       \arg        GPTIMER_DMACFG_DMATA_ESSEL: DMA transfer address is GPTIMER_ESSEL
       \arg        GPTIMER_DMACFG_DMATA_DSSEL: DMA transfer address is GPTIMER_DSSEL
       \arg        GPTIMER_DMACFG_DMATA_RSSEL: DMA transfer address is GPTIMER_RSSEL
       \arg        GPTIMER_DMACFG_DMATA_CH0CSSEL: DMA transfer address is GPTIMER_CH0CSSEL
       \arg        GPTIMER_DMACFG_DMATA_CH1CSSEL: DMA transfer address is GPTIMER_CH0CSSEL
       \arg        GPTIMER_DMACFG_DMATA_CTL1: DMA transfer address is GPTIMER_CTL0
       \arg        GPTIMER_DMACFG_DMATA_UPSSR: DMA transfer address is GPTIMER_CUPEVSSEL
       \arg        GPTIMER_DMACFG_DMATA_DNSSR: DMA transfer address is GPTIMER_CDNEVSSEL
       \arg        GPTIMER_DMACFG_DMATA_CH0CTL: DMA transfer address is GPTIMER_CH0CTL
       \arg        GPTIMER_DMACFG_DMATA_CH1CTL: DMA transfer address is GPTIMER_CH1CTL
       \arg        GPTIMER_DMACFG_DMATA_CHCTL: DMA transfer address is GPTIMER_CHCTL
       \arg        GPTIMER_DMACFG_DMATA_DMAINTEN: DMA transfer address is GPTIMER_DMAINTEN
       \arg        GPTIMER_DMACFG_DMATA_INTF: DMA transfer address is GPTIMER_INTF
       \arg        GPTIMER_DMACFG_DMATA_UPSSEL: DMA transfer address is GPTIMER_UPSSEL
       \arg        GPTIMER_DMACFG_DMATA_CNT: DMA transfer address is GPTIMER_CNT
       \arg        GPTIMER_DMACFG_DMATA_PSC: DMA transfer address is GPTIMER_PSC
       \arg        GPTIMER_DMACFG_DMATA_CAR: DMA transfer address is GPTIMER_CAR
       \arg        GPTIMER_DMACFG_DMATA_CH0CV: DMA transfer address is GPTIMER_CH0CV
       \arg        GPTIMER_DMACFG_DMATA_CH1CV: DMA transfer address is GPTIMER_CH1CV
       \arg        GPTIMER_DMACFG_DMATA_CH0COMV_ADD: DMA transfer address is GPTIMER_CH0COMV_ADD
       \arg        GPTIMER_DMACFG_DMATA_CH1COMV_ADD: DMA transfer address is GPTIMER_CH1COMV_ADD
       \arg        GPTIMER_DMACFG_DMATA_DTCTL: DMA transfer address is GPTIMER_DTCTL
       \arg        GPTIMER_DMACFG_DMATA_ADCTL: DMA transfer address is GPTIMER_ADCTL
       \arg        GPTIMER_DMACFG_DMATA_ADCCR1: DMA transfer address is GPTIMER_ADCCR1
       \arg        GPTIMER_DMACFG_DMATA_ADCCR2: DMA transfer address is GPTIMER_ADCCR2
       \arg        GPTIMER_DMACFG_DMATA_ADCTRGS: DMA transfer address is GPTIMER_ADCTRGS
       \arg        GPTIMER_DMACFG_DMATA_ADDINTSCTL0: DMA transfer address is GPTIMER_ADDINTSCTL0
       \arg        GPTIMER_DMACFG_DMATA_ADDINTSCTL1: DMA transfer address is GPTIMER_ADDINTSCTL1
       \arg        GPTIMER_DMACFG_DMATA_IADCTSS: DMA transfer address is GPTIMER_IADCTSS
       \arg        GPTIMER_DMACFG_DMATA_CREP: DMA transfer address is GPTIMER_CREP
       \arg        GPTIMER_DMACFG_DMATA_SYNRSTCTL: DMA transfer address is GPTIMER_SYNRSTCTL
       \param[in]  dma_lenth:
                   only one parameter can be selected which is shown as below:
       \arg        GPTIMER_DMACFG_DMATC_xTRANSFER(x=1..35): DMA transfer x time
    \param[out] none
    \retval     none
*/
void gptimer_dma_transfer_config(uint32_t timer_periph, uint32_t dma_baseaddr, uint32_t dma_lenth)
{
    GPTIMER_DMACFG(timer_periph) &= (~(uint32_t)(GPTIMER_DMACFG_DMATA | GPTIMER_DMACFG_DMATC));
    GPTIMER_DMACFG(timer_periph) |= (uint32_t)((dma_baseaddr & GPTIMER_DMACFG_DMATA) | (dma_lenth & GPTIMER_DMACFG_DMATC));
}

/*!
    \brief      initialize GPTIMER channel output parameter struct with a default value (API_ID(0x002FU))
    \param[in]  ocpara: GPTIMER channel n output parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_struct_para_init(gptimer_oc_parameter_struct *ocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x002FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel output parameter struct member with the default value */
        ocpara->chxcv_up_output_level                   = GPTIMER_MATCH_OUTPUT_KEEP;
        ocpara->chxcv_down_output_level                 = GPTIMER_MATCH_OUTPUT_KEEP;
        ocpara->chxcomv_add_up_output_level             = GPTIMER_MATCH_OUTPUT_KEEP;
        ocpara->chxcomv_add_down_output_level           = GPTIMER_MATCH_OUTPUT_KEEP;
        ocpara->period_end_output_level                 = GPTIMER_PERIOD_END_OUTPUT_KEEP;
        ocpara->cnt_enable_disable_oc_en                = GPTIMER_CNT_ENABLE_DISABLE_OC_KEEP;
        ocpara->cnt_enable_output_level                 = GPTIMER_CNT_ENABLE_OUTPUT_LOW;
        ocpara->cnt_disable_output_level                = GPTIMER_CNT_DISABLE_OUTPUT_LOW;
        ocpara->output_stop_output_level                = GPTIMER_OUTPUT_STOP_OUTPUT_KEEP;
        ocpara->force_duty_output_mode                  = GPTIMER_COMPARE_DUTY_OUTPUT;
        ocpara->force_duty_output_time                  = GPTIMER_FORCE_DUTY_OUTPUT_NEXT_PERIOD;
        ocpara->force_duty_end_output_level             = GPTIMER_FORCE_DUTY_END_BASE_OUTPUT_KEEP;
        ocpara->compare_period_end_priority_control     = GPRIMER_PERIOD_END_OUTPUT_COMPARE;
    }
}

/*!
    \brief      configure channel output mode (API_ID(0x0030U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  ocpara: GPTIMER channel n output parameter struct
                  chxcv_down_output_level: GPTIMER_MATCH_OUTPUT_KEEP, GPTIMER_MATCH_OUTPUT_LOW, GPTIMER_MATCH_OUTPUT_HIGH, GPTIMER_MATCH_OUTPUT_TOGGLE
                  chxcv_up_output_level: GPTIMER_MATCH_OUTPUT_KEEP, GPTIMER_MATCH_OUTPUT_LOW, GPTIMER_MATCH_OUTPUT_HIGH, GPTIMER_MATCH_OUTPUT_TOGGLE
                  chxcomv_add_down_output_level: GPTIMER_MATCH_OUTPUT_KEEP, GPTIMER_MATCH_OUTPUT_LOW, GPTIMER_MATCH_OUTPUT_HIGH, GPTIMER_MATCH_OUTPUT_TOGGLE
                  chxcomv_add_up_output_level: GPTIMER_MATCH_OUTPUT_KEEP, GPTIMER_MATCH_OUTPUT_LOW, GPTIMER_MATCH_OUTPUT_HIGH, GPTIMER_MATCH_OUTPUT_TOGGLE
                  period_end_output_level: GPTIMER_PERIOD_END_OUTPUT_KEEP, GPTIMER_PERIOD_END_OUTPUT_LOW, GPTIMER_PERIOD_END_OUTPUT_HIGH, GPTIMER_PERIOD_END_OUTPUT_TOGGLE
                  cnt_enable_disable_oc_en: GPTIMER_CNT_ENABLE_DISABLE_OC_KEEP, GPTIMER_CNT_ENABLE_DISABLE_OC_CTL
                  cnt_enable_output_level: GPTIMER_CNT_ENABLE_OUTPUT_LOW, GPTIMER_CNT_ENABLE_OUTPUT_HIGH
                  cnt_disable_output_level: GPTIMER_CNT_DISABLE_OUTPUT_LOW, GPTIMER_CNT_DISABLE_OUTPUT_HIGH
                  output_stop_output_level: GPTIMER_OUTPUT_STOP_OUTPUT_KEEP, GPTIMER_OUTPUT_STOP_OUTPUT_HIZ, GPTIMER_OUTPUT_STOP_OUTPUT_LOW, GPTIMER_OUTPUT_STOP_OUTPUT_HIGH
                  force_duty_output_mode: GPTIMER_COMPARE_DUTY_OUTPUT, GPTIMER_FORCE_0_DUTY_OUTPUT,GPTIMER_FORCE_100_DUTY_OUTPUT
                  force_duty_output_time: GPTIMER_FORCE_DUTY_OUTPUT_NEXT_PERIOD, GPTIMER_FORCE_DUTY_OUTPUT_IMMEDIATELY
                  force_duty_end_output_level: GPTIMER_FORCE_DUTY_END_BASE_OUTPUT_KEEP, GPTIMER_FORCE_DUTY_END_BASE_OUTPUT_COMPARE
                  compare_period_end_priority_control: GPRIMER_PERIOD_END_OUTPUT_COMPARE, GPRIMER_PERIOD_END_OUTPUT_KEEP
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_config(uint32_t timer_periph, uint16_t channel, gptimer_oc_parameter_struct *ocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(ocpara)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0030U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        switch(channel) {
        /* configure GPTIMER_CH0 */
        case GPTIMER_CH0:
            GPTIMER_CH0CTL(timer_periph) &= ~(uint32_t)(GPTIMER_CH0CTL_CH0COMDW | GPTIMER_CH0CTL_CH0COMUP | \
                                                        GPTIMER_CH0CTL_CH0ACOMDW | GPTIMER_CH0CTL_CH0ACOMUP | \
                                                        GPTIMER_CH0CTL_CH0EFF | GPTIMER_CH0CTL_CH0OUTM | \
                                                        GPTIMER_CH0CTL_CH0OUTCTL | GPTIMER_CH0CTL_CH0REDUTY | \
                                                        GPTIMER_CH0CTL_CH0ENDOUT | GPTIMER_CH0CTL_CH0ENOUT | \
                                                        GPTIMER_CH0CTL_CH0DISOUT | GPTIMER_CH0CTL_CH0OUT | GPTIMER_CH0CTL_CH0INVSOUT);
            GPTIMER_CH0CTL(timer_periph) |= (uint32_t)((ocpara->chxcv_down_output_level & OUTPUT_LEVEL_MASK) | ((ocpara->chxcv_up_output_level & OUTPUT_LEVEL_MASK) << 2) | \
                                                       ((ocpara->chxcomv_add_down_output_level & OUTPUT_LEVEL_MASK) << 4) | ((ocpara->chxcomv_add_up_output_level & OUTPUT_LEVEL_MASK) << 6) | \
                                                       (ocpara->period_end_output_level & GPTIMER_CH0CTL_CH0ENDOUT) | (ocpara->cnt_enable_disable_oc_en & GPTIMER_CH0CTL_CH0OUT) | \
                                                       (ocpara->cnt_enable_output_level & GPTIMER_CH0CTL_CH0ENOUT) | (ocpara->cnt_disable_output_level & GPTIMER_CH0CTL_CH0DISOUT) | \
                                                       (ocpara->output_stop_output_level & GPTIMER_CH0CTL_CH0INVSOUT) | (ocpara->force_duty_output_mode & GPTIMER_CH0CTL_CH0OUTM) | \
                                                       (ocpara->force_duty_output_time & GPTIMER_CH0CTL_CH0OUTCTL) | (ocpara->force_duty_end_output_level & GPTIMER_CH0CTL_CH0REDUTY) | \
                                                       (ocpara->compare_period_end_priority_control & GPTIMER_CH0CTL_CH0EFF));
            break;
        case GPTIMER_CH1:
            /* configure GPTIMER_CH1 */
            GPTIMER_CH1CTL(timer_periph) &= ~(uint32_t)(GPTIMER_CH1CTL_CH1COMDW | GPTIMER_CH1CTL_CH1COMUP | \
                                                        GPTIMER_CH1CTL_CH1ACOMDW | GPTIMER_CH1CTL_CH1ACOMUP | \
                                                        GPTIMER_CH1CTL_CH1EFF | GPTIMER_CH1CTL_CH1OUTM | \
                                                        GPTIMER_CH1CTL_CH1OUTCTL | GPTIMER_CH1CTL_CH1REDUTY | \
                                                        GPTIMER_CH1CTL_CH1ENDOUT | GPTIMER_CH1CTL_CH1ENOUT | \
                                                        GPTIMER_CH1CTL_CH1DISOUT | GPTIMER_CH1CTL_CH1OUT | GPTIMER_CH1CTL_CH1INVSOUT);
            GPTIMER_CH1CTL(timer_periph) |= (uint32_t)((ocpara->chxcv_down_output_level & OUTPUT_LEVEL_MASK) | ((ocpara->chxcv_up_output_level & OUTPUT_LEVEL_MASK) << 2) | \
                                                       ((ocpara->chxcomv_add_down_output_level & OUTPUT_LEVEL_MASK) << 4) | ((ocpara->chxcomv_add_up_output_level & OUTPUT_LEVEL_MASK) << 6) | \
                                                       (ocpara->period_end_output_level & GPTIMER_CH1CTL_CH1ENDOUT) | (ocpara->cnt_enable_disable_oc_en & GPTIMER_CH1CTL_CH1OUT) | \
                                                       (ocpara->cnt_enable_output_level & GPTIMER_CH1CTL_CH1ENOUT) | (ocpara->cnt_disable_output_level & GPTIMER_CH1CTL_CH1DISOUT) | \
                                                       (ocpara->output_stop_output_level & GPTIMER_CH1CTL_CH1INVSOUT) | (ocpara->force_duty_output_mode & GPTIMER_CH1CTL_CH1OUTM) | \
                                                       (ocpara->force_duty_output_time & GPTIMER_CH1CTL_CH1OUTCTL) | (ocpara->force_duty_end_output_level & GPTIMER_CH1CTL_CH1REDUTY) | \
                                                       (ocpara->compare_period_end_priority_control & GPTIMER_CH1CTL_CH1EFF));
            break;
        default:
            break;
        }
    }
}

