burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
/*!
    \brief      configure channel output force duty (API_ID(0x0031U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  duty: GPTIMER_COMPARE_DUTY_OUTPUT, GPTIMER_FORCE_0_DUTY_OUTPUT, GPTIMER_FORCE_100_DUTY_OUTPUT
    \param[in]  output_time: GPTIMER_FORCE_DUTY_OUTPUT_IMMEDIATELY, GPTIMER_FORCE_DUTY_OUTPUT_NEXT_PERIOD
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_force_duty_config(uint32_t timer_periph, uint16_t channel, uint32_t duty,
                                              uint32_t output_time)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CH0CTL(timer_periph) &= ~(uint32_t)GPTIMER_CH0CTL_CH0OUTM;
        GPTIMER_CH0CTL(timer_periph) |= (uint32_t)(duty & GPTIMER_CH0CTL_CH0OUTM);
        GPTIMER_CH0CTL(timer_periph) &= ~(uint32_t)GPTIMER_CH0CTL_CH0OUTCTL;
        GPTIMER_CH0CTL(timer_periph) |= (uint32_t)(output_time & GPTIMER_CH0CTL_CH0OUTCTL);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CH1CTL(timer_periph) &= ~(uint32_t)GPTIMER_CH1CTL_CH1OUTM;
        GPTIMER_CH1CTL(timer_periph) |= (uint32_t)(duty & GPTIMER_CH1CTL_CH1OUTM);
        GPTIMER_CH1CTL(timer_periph) &= ~(uint32_t)GPTIMER_CH1CTL_CH1OUTCTL;
        GPTIMER_CH1CTL(timer_periph) |= (uint32_t)(output_time & GPTIMER_CH1CTL_CH1OUTCTL);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel output compare value (API_ID(0x0032U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  value: 0~65535
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_compare_value_config(uint32_t timer_periph, uint16_t channel, uint16_t value)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CH0CV(timer_periph) = (uint32_t)value;
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CH1CV(timer_periph) = (uint32_t)value;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel output additional compare value (API_ID(0x0033U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  value: 0~65535
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_additional_compare_value_config(uint32_t timer_periph, uint16_t channel, uint16_t value)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CH0COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CH1COMV_ADD(timer_periph) = (uint32_t)value;
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel output shadow function (API_ID(0x0034U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        GPTIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH0COMSEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 4U) & GPTIMER_CHCTL_CH0COMSEN);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH1COMSEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 12U) & GPTIMER_CHCTL_CH1COMSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel output additional shadow function (API_ID(0x0035U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        GPTIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_additional_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH0COMADDSEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 5U) & GPTIMER_CHCTL_CH0COMADDSEN);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH1COMADDSEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 13U) & GPTIMER_CHCTL_CH1COMADDSEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel output additional shadow function (API_ID(0x0036U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  ocshadow: channel output compare shadow
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_OC_SHADOW_ENABLE: channel output compare shadow enable
      \arg        GPTIMER_OC_SHADOW_DISABLE: channel output compare shadow disable
    \param[out] none
    \retval     none
*/
void gptimer_channel_output_control_shadow_config(uint32_t timer_periph, uint16_t channel, uint16_t ocshadow)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH0SEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 6U) & GPTIMER_CHCTL_CH0SEN);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH1SEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(((uint32_t)(ocshadow) << 14U) & GPTIMER_CHCTL_CH1SEN);
        break;
    default:
        break;
    }
}

/*!
    \brief      enable two channel simultaneous output high check function (API_ID(0x0037U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_two_channel_output_high_check_enable(uint32_t timer_periph)
{
    GPTIMER_DMAINTEN(timer_periph) |= (uint32_t)GPTIMER_DMAINTEN_CHHOUTDET;
}

/*!
    \brief      disable two channel simultaneous output high check function (API_ID(0x0038U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_two_channel_output_high_check_disable(uint32_t timer_periph)
{
    GPTIMER_DMAINTEN(timer_periph) &= ~(uint32_t)GPTIMER_DMAINTEN_CHHOUTDET;
}

/*!
    \brief      enable two channel simultaneous output low check function (API_ID(0x0039U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_two_channel_output_low_check_enable(uint32_t timer_periph)
{
    GPTIMER_DMAINTEN(timer_periph) |= (uint32_t)GPTIMER_DMAINTEN_CHLOUTDET;
}

/*!
    \brief      disable two channel simultaneous output low check function (API_ID(0x003AU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_two_channel_output_low_check_disable(uint32_t timer_periph)
{
    GPTIMER_DMAINTEN(timer_periph) &= ~(uint32_t)GPTIMER_DMAINTEN_CHLOUTDET;
}

/*!
    \brief      enable counter cycle synchronization signal output (API_ID(0x003BU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_period_signal_output_enable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) |= (uint32_t)GPTIMER_CTL0_CCSOEN;
}

/*!
    \brief      disable counter cycle synchronization signal output (API_ID(0x003CU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     none
*/
void gptimer_period_signal_output_disable(uint32_t timer_periph)
{
    GPTIMER_CTL0(timer_periph) &= ~((uint32_t)GPTIMER_CTL0_CCSOEN);
}

/*!
    \brief      configure stop output source (API_ID(0x003DU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  group:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_OUTPUT_STOP_GTOC0: output stop GTOC0
      \arg        GPTIMER_OUTPUT_STOP_GTOC1: output stop GTOC1
      \arg        GPTIMER_OUTPUT_STOP_GTOC2: output stop GTOC2
      \arg        GPTIMER_OUTPUT_STOP_GTOC3: output stop GTOC3
    \param[out] none
    \retval     none
*/
void gptimer_stop_output_set_select(uint32_t timer_periph, uint32_t group)
{
    GPTIMER_DMAINTEN(timer_periph) &= ~(uint32_t)GPTIMER_DMAINTEN_CLOSSEL;
    GPTIMER_DMAINTEN(timer_periph) |= (uint32_t)(group & GPTIMER_DMAINTEN_CLOSSEL);
}

/*!
    \brief      output stop recover time select (API_ID(0x003EU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  time:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_OUTPUT_RECOVER_PERIOD_END: output stop recover time is period end
      \arg        GPTIMER_OUTPUT_RECOVER_CREP_END: output stop recover time is crep end
    \param[out] none
    \retval     none
*/
void gptimer_stop_output_recover_time_select(uint32_t timer_periph, uint32_t time)
{
    GPTIMER_CHCTL(timer_periph) &= ~(uint32_t)GPTIMER_CHCTL_STORESEL;
    GPTIMER_CHCTL(timer_periph) |= (uint32_t)(time & GPTIMER_CHCTL_STORESEL);
}

/*!
    \brief      initialize GPTIMER complementary output parameter struct with a default value (API_ID(0x003FU))
    \param[in]  comocpara: GPTIMER complementary output parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_channel_complementary_output_struct_para_init(gptimer_com_oc_parameter_struct *comocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(comocpara)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the channel output parameter struct member with the default value */
        comocpara->complementary_mode         = GPTIMER_CH1_MODE_INDEPENDENTLY;
        comocpara->deadtime_enable            = GPTIMER_DEADTIME_DISABLE;
        comocpara->deadtime_mode              = GPTIMER_DEADTIME_MODE_SYMMETRIC;
        comocpara->rising_deadtime_value      = 0U;
        comocpara->falling_deadtime_value     = 0U;
        comocpara->rising_deadtime_shadow     = GPTIMER_DT_RISING_SHADOW_DISABLE;
        comocpara->falling_deadtime_shadow    = GPTIMER_DT_FALLING_SHADOW_DISABLE;
    }
}

/*!
    \brief      configure GPTIMER channel complementary output function (API_ID(0x0040U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  comocpara: GPTIMER complementary output parameter struct
                  complementary_mode: GPTIMER_CH1_MODE_INDEPENDENTLY, GPTIMER_CH1_MODE_COMPLEMENTARY
                  deadtime_enable: GPTIMER_DEADTIME_DISABLE, GPTIMER_DEADTIME_ENABLE
                  deadtime_mode: GPTIMER_DEADTIME_MODE_SYMMETRIC, GPTIMER_DEADTIME_MODE_ASYMMETRIC
                  rising_deadtime_value: 0~255
                  falling_deadtime_value: 0~255
                  rising_deadtime_shadow: GPTIMER_DT_RISING_SHADOW_DISABLE, GPTIMER_DT_RISING_SHADOW_ENABLE
                  falling_deadtime_shadow: GPTIMER_DT_FALLING_SHADOW_DISABLE, GPTIMER_DT_FALLING_SHADOW_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_channel_complementary_output_config(uint32_t timer_periph, gptimer_com_oc_parameter_struct *comocpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(comocpara)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0040U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH1MSEL);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(comocpara->complementary_mode & GPTIMER_CHCTL_CH1MSEL);

        GPTIMER_DTCTL(timer_periph) &= (~(uint32_t)GPTIMER_DTCTL_DTASYEN);
        GPTIMER_DTCTL(timer_periph) |= (uint32_t)(comocpara->deadtime_mode & GPTIMER_DTCTL_DTASYEN);

        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_DTEN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(comocpara->deadtime_enable & GPTIMER_CHCTL_DTEN);

