burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
        GPTIMER_DTCTL(timer_periph) &= (~(uint32_t)GPTIMER_DTCTL_REDTCFG);
        GPTIMER_DTCTL(timer_periph) |= (uint32_t)(comocpara->rising_deadtime_value & GPTIMER_DTCTL_REDTCFG);

        GPTIMER_DTCTL(timer_periph) &= (~(uint32_t)GPTIMER_DTCTL_FEDTCFG);
        GPTIMER_DTCTL(timer_periph) |= (uint32_t)((comocpara->falling_deadtime_value << 16) & GPTIMER_DTCTL_FEDTCFG);

        GPTIMER_DTCTL(timer_periph) &= (~(uint32_t)GPTIMER_DTCTL_REDTSEN);
        GPTIMER_DTCTL(timer_periph) |= (uint32_t)(comocpara->rising_deadtime_shadow & GPTIMER_DTCTL_REDTSEN);

        GPTIMER_DTCTL(timer_periph) &= (~(uint32_t)GPTIMER_DTCTL_FEDTSEN);
        GPTIMER_DTCTL(timer_periph) |= (uint32_t)(comocpara->falling_deadtime_shadow & GPTIMER_DTCTL_FEDTSEN);
    }
}

/*!
    \brief      configure channel input or output (API_ID(0x0041U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  io_direction:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CHANNEL_OUTPUT: channel output
      \arg        GPTIMER_CHANNEL_INPUT: channel input
    \param[out] none
    \retval     none
*/
void gptimer_channel_io_direction_config(uint32_t timer_periph, uint16_t channel, uint32_t io_direction)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH0SEL);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)(io_direction & GPTIMER_CHCTL_CH0SEL);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH1SEL);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)((io_direction << 8) & GPTIMER_CHCTL_CH1SEL);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel input or output enable state (API_ID(0x0042U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  state:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CHANNEL_ENABLE: channel enable
      \arg        GPTIMER_CHANNEL_DISABLE: channel disable
    \param[out] none
    \retval     none
*/
void gptimer_channel_io_state_config(uint32_t timer_periph, uint16_t channel, uint32_t state)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH0EN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)((state) & GPTIMER_CHCTL_CH0EN);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CHCTL(timer_periph) &= (~(uint32_t)GPTIMER_CHCTL_CH1EN);
        GPTIMER_CHCTL(timer_periph) |= (uint32_t)((uint32_t)(state << 8U) & GPTIMER_CHCTL_CH1EN);
        break;
    default:
        break;
    }
}

/*!
    \brief      initialize GPTIMER counter capture source init parameter struct with a default value (API_ID(0x0043U))
    \param[in]  counter_capture_source_para: counter capture source init parameter struct
    \param[out] none
    \retval     none
*/
void gptimer_capture_source_struct_para_init(gptimer_capture_source_parameter_struct *counter_capture_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(counter_capture_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0043U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* initialize the init parameter struct member with the default value */
        counter_capture_source_para->capture_source_eti0 = GPTIMER_ETI0_TRG_DISABLE;
        counter_capture_source_para->capture_source_eti1 = GPTIMER_ETI1_TRG_DISABLE;
        counter_capture_source_para->capture_source_eti2 = GPTIMER_ETI2_TRG_DISABLE;
        counter_capture_source_para->capture_source_eti3 = GPTIMER_ETI3_TRG_DISABLE;
        counter_capture_source_para->capture_source_ch0 = GPTIMER_CH0_TRG_DISABLE;
        counter_capture_source_para->capture_source_ch1 = GPTIMER_CH1_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel0 = GPTIMER_EVSEL0_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel1 = GPTIMER_EVSEL1_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel2 = GPTIMER_EVSEL2_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel3 = GPTIMER_EVSEL3_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel4 = GPTIMER_EVSEL4_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel5 = GPTIMER_EVSEL5_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel6 = GPTIMER_EVSEL6_TRG_DISABLE;
        counter_capture_source_para->capture_source_evsel7 = GPTIMER_EVSEL7_TRG_DISABLE;
    }
}

/*!
    \brief      initialize GPTIMER counter capture source (API_ID(0x0044U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  capture_source_para: counter capture source init parameter struct
                  capture_source_eti0: GPTIMER_ETI0_TRG_DISABLE, GPTIMER_ETI0_TRG_EDGE_RISING, GPTIMER_ETI0_TRG_EDGE_FALLING, GPTIMER_ETI0_TRG_EDGE_BOTH
                  capture_source_eti1: GPTIMER_ETI1_TRG_DISABLE, GPTIMER_ETI1_TRG_EDGE_RISING, GPTIMER_ETI1_TRG_EDGE_FALLING, GPTIMER_ETI1_TRG_EDGE_BOTH
                  capture_source_eti2: GPTIMER_ETI2_TRG_DISABLE, GPTIMER_ETI2_TRG_EDGE_RISING, GPTIMER_ETI2_TRG_EDGE_FALLING, GPTIMER_ETI2_TRG_EDGE_BOTH
                  capture_source_eti3: GPTIMER_ETI3_TRG_DISABLE, GPTIMER_ETI3_TRG_EDGE_RISING, GPTIMER_ETI3_TRG_EDGE_FALLING, GPTIMER_ETI3_TRG_EDGE_BOTH
                  capture_source_ch0: GPTIMER_CH0_TRG_DISABLE, GPTIMER_CH0_TRG_EDGE_RISING, GPTIMER_CH0_TRG_EDGE_FALLING, GPTIMER_CH0_TRG_EDGE_BOTH
                  capture_source_ch1: GPTIMER_CH1_TRG_DISABLE, GPTIMER_CH1_TRG_EDGE_RISING, GPTIMER_CH1_TRG_EDGE_FALLING, GPTIMER_CH1_TRG_EDGE_BOTH
                  capture_source_evsel0: GPTIMER_EVSEL0_TRG_DISABLE, GPTIMER_EVSEL0_TRG_ENABLE
                  capture_source_evsel1: GPTIMER_EVSEL1_TRG_DISABLE, GPTIMER_EVSEL1_TRG_ENABLE
                  capture_source_evsel2: GPTIMER_EVSEL2_TRG_DISABLE, GPTIMER_EVSEL2_TRG_ENABLE
                  capture_source_evsel3: GPTIMER_EVSEL3_TRG_DISABLE, GPTIMER_EVSEL3_TRG_ENABLE
                  capture_source_evsel4: GPTIMER_EVSEL4_TRG_DISABLE, GPTIMER_EVSEL4_TRG_ENABLE
                  capture_source_evsel5: GPTIMER_EVSEL5_TRG_DISABLE, GPTIMER_EVSEL5_TRG_ENABLE
                  capture_source_evsel6: GPTIMER_EVSEL6_TRG_DISABLE, GPTIMER_EVSEL6_TRG_ENABLE
                  capture_source_evsel7: GPTIMER_EVSEL7_TRG_DISABLE, GPTIMER_EVSEL7_TRG_ENABLE
    \param[out] none
    \retval     none
*/
void gptimer_capture_source_config(uint32_t timer_periph, uint16_t channel,
                                   gptimer_capture_source_parameter_struct *capture_source_para)
{
#ifdef FW_DEBUG_ERR_REPORT
    /* check parameter */
    if(NOT_VALID_POINTER(capture_source_para)) {
        fw_debug_report_err(GPTIMER_MODULE_ID, API_ID(0x0044U), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(channel == GPTIMER_CH0) {
            GPTIMER_CH0CSSEL(timer_periph) = (uint32_t)((uint32_t)(capture_source_para->capture_source_eti0 & GPTIMER_CH0CSSEL_ETI0CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_eti1 & GPTIMER_CH0CSSEL_ETI1CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_eti2 & GPTIMER_CH0CSSEL_ETI2CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_eti3 & GPTIMER_CH0CSSEL_ETI3CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_ch0 & GPTIMER_CH0CSSEL_CH0CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_ch1 & GPTIMER_CH0CSSEL_CH1CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel0 & GPTIMER_CH0CSSEL_EVSEL0CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel1 & GPTIMER_CH0CSSEL_EVSEL1CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel2 & GPTIMER_CH0CSSEL_EVSEL2CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel3 & GPTIMER_CH0CSSEL_EVSEL3CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel4 & GPTIMER_CH0CSSEL_EVSEL4CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel5 & GPTIMER_CH0CSSEL_EVSEL5CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel6 & GPTIMER_CH0CSSEL_EVSEL6CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel7 & GPTIMER_CH0CSSEL_EVSEL7CH0IC));
        } else if(channel == GPTIMER_CH1) {
            GPTIMER_CH1CSSEL(timer_periph) = (uint32_t)((uint32_t)(capture_source_para->capture_source_eti0 & GPTIMER_CH1CSSEL_ETI0CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_eti1 & GPTIMER_CH1CSSEL_ETI1CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_eti2 & GPTIMER_CH1CSSEL_ETI2CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_eti3 & GPTIMER_CH1CSSEL_ETI3CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_ch0 & GPTIMER_CH1CSSEL_CH0CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_ch1 & GPTIMER_CH1CSSEL_CH1CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel0 & GPTIMER_CH1CSSEL_EVSEL0CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel1 & GPTIMER_CH1CSSEL_EVSEL1CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel2 & GPTIMER_CH1CSSEL_EVSEL2CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel3 & GPTIMER_CH1CSSEL_EVSEL3CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel4 & GPTIMER_CH1CSSEL_EVSEL4CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel5 & GPTIMER_CH1CSSEL_EVSEL5CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel6 & GPTIMER_CH1CSSEL_EVSEL6CH0IC) |
                                                        (uint32_t)(capture_source_para->capture_source_evsel7 & GPTIMER_CH1CSSEL_EVSEL7CH0IC));
        } else {
            /* illegal parameters */
        }
    }
}

/*!
    \brief      configure channel input capture filter (API_ID(0x0045U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  number: 0~15
    \param[out] none
    \retval     none
*/
void gptimer_channel_input_capture_filter_config(uint32_t timer_periph, uint32_t channel, uint32_t number)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CH0CTL(timer_periph) &= ~(uint32_t)GPTIMER_CH0CTL_CH0CAPFLT;
        GPTIMER_CH0CTL(timer_periph) |= (uint32_t)((number << 28) & GPTIMER_CH0CTL_CH0CAPFLT);
        break;
    case GPTIMER_CH1:
        /* configure GPTIMER_CH1 */
        GPTIMER_CH1CTL(timer_periph) &= ~(uint32_t)GPTIMER_CH1CTL_CH1CAPFLT;
        GPTIMER_CH1CTL(timer_periph) |= (uint32_t)((number << 28) & GPTIMER_CH1CTL_CH1CAPFLT);
        break;
    default:
        break;
    }
}

/*!
    \brief      configure channel input capture prescaler (API_ID(0x0046U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[in]  prescaler: GPTIMER_IC_PSC_DIV1, GPTIMER_IC_PSC_DIV2, GPTIMER_IC_PSC_DIV4, GPTIMER_IC_PSC_DIV8
    \param[out] none
    \retval     none
*/
void gptimer_channel_input_capture_prescaler_config(uint32_t timer_periph, uint16_t channel, uint32_t prescaler)
{
    switch(channel) {
    /* configure GPTIMER_CH0 */
    case GPTIMER_CH0:
        GPTIMER_CH0CTL(timer_periph) &= (~(uint32_t)GPTIMER_CH0CTL_CH0CAPPSC);
        GPTIMER_CH0CTL(timer_periph) |= (uint32_t)(prescaler & GPTIMER_CH0CTL_CH0CAPPSC);
        break;
    /* configure GPTIMER_CH1 */
    case GPTIMER_CH1:
        GPTIMER_CH1CTL(timer_periph) &= (~(uint32_t)GPTIMER_CH1CTL_CH1CAPPSC);
        GPTIMER_CH1CTL(timer_periph) |= (uint32_t)(prescaler & GPTIMER_CH1CTL_CH1CAPPSC);
        break;
    default:
        break;
    }
}

/*!
    \brief      read channel capture compare register value (API_ID(0x0047U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  channel: GPTIMER channel
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CH0: channel 0
      \arg        GPTIMER_CH1: channel 1
    \param[out] none
    \retval     count value
*/
uint32_t gptimer_channel_capture_value_register_read(uint32_t timer_periph, uint16_t channel)
{
    uint32_t count_value = 0U;
    switch(channel) {
    case GPTIMER_CH0:
        /* read GPTIMER_CH0 capture compare register value */
        count_value = GPTIMER_CH0CV(timer_periph);
        break;
    case GPTIMER_CH1:
        /* read GPTIMER_CH1 capture compare register value */
        count_value = GPTIMER_CH1CV(timer_periph);
        break;
    default:
        break;
    }
    return (count_value);
}

/*!
    \brief      select synchronization control set (API_ID(0x0048U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  set:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_SYNRSTCTL_SYNCSSEL_SET0: synchronization control set0
      \arg        GPTIMER_SYNRSTCTL_SYNCSSEL_SET1: synchronization control set1
    \param[out] none
    \retval     none
*/
void gptimer_counter_sync_control_select(uint32_t timer_periph, uint32_t set)
{
    GPTIMER_SYNRSTCTL(timer_periph) &= ~(uint32_t)GPTIMER_SYNRSTCTL_SYNCSSEL;
    GPTIMER_SYNRSTCTL(timer_periph) |= (uint32_t)(set & GPTIMER_SYNRSTCTL_SYNCSSEL);
}

/*!
    \brief      select counter sync reset source (API_ID(0x0049U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  source:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_SYNC_RESET_CH0CV: ch0cv as counter sync reset source
      \arg        GPTIMER_SYNC_RESET_CH1CV: ch1cv as counter sync reset source
      \arg        GPTIMER_SYNC_RESET_CH0COMV_ADD: ch0comval_add as counter sync reset source
      \arg        GPTIMER_SYNC_RESET_CH1COMV_ADD: ch1comval_add as counter sync reset source
      \arg        GPTIMER_SYNC_RESET_OF: overflow as counter sync reset source
      \arg        GPTIMER_SYNC_RESET_UF: underflow as counter sync reset source
      \arg        GPTIMER_SYNC_RESET_CH: channel input as counter sync reset source
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void gptimer_counter_sync_reset_source_select(uint32_t timer_periph, uint32_t source, ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        GPTIMER_SYNRSTCTL(timer_periph) |= (uint32_t)(source & COUNTER_SYNC_RESET_SOURCE_MASK);
    } else {
        GPTIMER_SYNRSTCTL(timer_periph) &= (~(uint32_t)(source & COUNTER_SYNC_RESET_SOURCE_MASK));
    }
}

/*!
    \brief  enable compare event produce a ADC converter trigger signal (API_ID(0x004AU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  compare_time:
                one or more parameter can be selected which is shown as below:
       \arg       GPTIMER_ADT1UEN: enable counter up ADTCV1[15:0] match event as adc trigger signal
       \arg       GPTIMER_ADT1DEN: enable counter down ADTCV1[15:0] match event as adc trigger signal
       \arg       GPTIMER_ADT2UEN: enable counter up ADTCV2[15:0] match event as adc trigger signal
       \arg       GPTIMER_ADT2DEN: enable counter down ADTCV2[15:0] match event as adc trigger signal
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_compare_enable(uint32_t timer_periph, uint32_t compare_time)
{
    GPTIMER_ADCTL(timer_periph) |= (uint32_t)(compare_time & COMPARISON_GENERATE_TRIGGER_MASK);
}

/*!
    \brief  disable compare event produce a ADC converter trigger signal (API_ID(0x004BU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  compare_time:
                one or more parameter can be selected which is shown as below:
       \arg       GPTIMER_ADT1UEN: enable counter up ADTCV1[15:0] match event as adc trigger signal
       \arg       GPTIMER_ADT1DEN: enable counter down ADTCV1[15:0] match event as adc trigger signal
       \arg       GPTIMER_ADT2UEN: enable counter up ADTCV2[15:0] match event as adc trigger signal
       \arg       GPTIMER_ADT2DEN: enable counter down ADTCV2[15:0] match event as adc trigger signal
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_compare_disable(uint32_t timer_periph, uint32_t compare_time)
{
    GPTIMER_ADCTL(timer_periph) &= (~(uint32_t)(compare_time & COMPARISON_GENERATE_TRIGGER_MASK));
}

/*!
    \brief  config trigger adc compare register value (API_ID(0x004CU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  compare:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_COMPARE1: select GPTIMERx_ADCCR1 ADTCV1
       \arg       GPTIMER_ADC_COMPARE2: select GPTIMERx_ADCCR2 ADTCV2
    \param[in]  value: 0~65535
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_compare_value_config(uint32_t timer_periph, uint32_t compare,  uint16_t value)
{
    switch(compare) {
    case GPTIMER_ADC_COMPARE1:
        GPTIMER_ADCCR1(timer_periph) = value;
        break;
    case GPTIMER_ADC_COMPARE2:
        GPTIMER_ADCCR2(timer_periph) = value;
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  enable adc compare register shadow function (API_ID(0x004DU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  compare:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_COMPARE1: select GPTIMERx_ADCCR1 ADTCV1
       \arg       GPTIMER_ADC_COMPARE2: select GPTIMERx_ADCCR2 ADTCV2
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_compare_shadow_enable(uint32_t timer_periph, uint32_t compare)
{
    switch(compare) {
    case GPTIMER_ADC_COMPARE1:
        GPTIMER_ADCTL(timer_periph) |= (uint32_t)GPTIMER_ADCTL_ADTCV1SEN;
        break;
    case GPTIMER_ADC_COMPARE2:
        GPTIMER_ADCTL(timer_periph) |= (uint32_t)GPTIMER_ADCTL_ADTCV2SEN;
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  disable adc compare register shadow function (API_ID(0x004EU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  compare:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_COMPARE1: select GPTIMERx_ADCCR1 ADTCV1
       \arg       GPTIMER_ADC_COMPARE2: select GPTIMERx_ADCCR2 ADTCV2
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_compare_shadow_disable(uint32_t timer_periph, uint32_t compare)
{
    switch(compare) {
    case GPTIMER_ADC_COMPARE1:
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADTCV1SEN;
        break;
    case GPTIMER_ADC_COMPARE2:
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADTCV2SEN;
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  enable trigger adc adsm signal (API_ID(0x004FU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  adsm:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADCSM3: adc monitor signal 3
       \arg       GPTIMER_ADCSM4: adc monitor signal 4
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_adsm_enable(uint32_t timer_periph, uint32_t adsm)
{
    if(adsm == GPTIMER_ADCSM3) {
        GPTIMER_ADCTL(timer_periph) |= (uint32_t)GPTIMER_ADCTL_ADCMS3EN;
    } else if(adsm == GPTIMER_ADCSM4) {
        GPTIMER_ADCTL(timer_periph) |= (uint32_t)GPTIMER_ADCTL_ADCMS4EN;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief  disable trigger adc adsm signal (API_ID(0x0050U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  adsm:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADCSM3: adc monitor signal 3
       \arg       GPTIMER_ADCSM4: adc monitor signal 4
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_adsm_disable(uint32_t timer_periph, uint32_t adsm)
{
    if(adsm == GPTIMER_ADCSM3) {
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADCMS3EN;
    } else if(adsm == GPTIMER_ADCSM4) {
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADCMS4EN;
    } else {
        /* illegal parameters */
    }
}

