burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
/*!
    \brief  select trigger adc adsm signal (API_ID(0x0051U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  adsm:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADCSM3: adc monitor signal 3
       \arg       GPTIMER_ADCSM4: adc monitor signal 4
    \param[in]  trg_source:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADSM_ADTCV1: adc monitor signal ADTCV1
       \arg       GPTIMER_ADSM_ADTCV2: adc monitor signal ADTCV2
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_adsm_select(uint32_t timer_periph, uint32_t adsm, uint32_t trg_source)
{
    switch(adsm) {
    case GPTIMER_ADCSM3:
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADCMS3SEL;
        if(trg_source == GPTIMER_ADSM_ADTCV2) {
            GPTIMER_ADCTL(timer_periph) |= (uint32_t)GPTIMER_ADCTL_ADCMS3SEL;
        }
        break;
    case GPTIMER_ADCSM4:
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADCMS4SEL;
        if(trg_source == GPTIMER_ADSM_ADTCV2) {
            GPTIMER_ADCTL(timer_periph) |= (uint32_t)GPTIMER_ADCTL_ADCMS4SEL;
        }
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  config trigger adc skipping value (API_ID(0x0052U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_count:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_SKIP_COUNT1: adc skipping counter 1
       \arg       GPTIMER_ADC_SKIP_COUNT2: adc skipping counter 2
    \param[in]  value: skipping value, 0~15
    \param[in]  initial_value: initial value, 0~15
    \param[in]  skipping_source:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_SKIP_NO: no counting, no skipping
       \arg       GPTIMER_ADC_SKIP_ADTCV1: the ADTCV1[15:0] comparison matching
       \arg       GPTIMER_ADC_SKIP_ADTCV2: the ADTCV2[15:0] comparison matching
       \arg       GPTIMER_ADC_SKIP_ADTCV1_OR_ADTCV2: the ADTCV1[15:0] or ADTCV2[15:0] comparison matching
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_skipping_config(uint32_t timer_periph, uint32_t skipping_count, uint32_t value, uint32_t initial_value,
                                         uint32_t skipping_source)
{
    switch(skipping_count) {
    case GPTIMER_ADC_SKIP_COUNT1:
        GPTIMER_ADCTRGS(timer_periph) &= ~(uint32_t)(GPTIMER_ADCTRGS_ADCC1SVAL | GPTIMER_ADCTRGS_ADCC1IVAL |
                                                     GPTIMER_ADCTRGS_ADCC1SKSEL);
        GPTIMER_ADCTRGS(timer_periph) |= (uint32_t)(((value & TRIGGER_ADC_SKIPPING_VALUE_MASK) << 4) |
                                                    ((initial_value & TRIGGER_ADC_SKIPPING_VALUE_MASK) << 8) | (skipping_source & GPTIMER_ADCTRGS_ADCC1SKSEL));
        break;
    case GPTIMER_ADC_SKIP_COUNT2:
        GPTIMER_ADCTRGS(timer_periph) &= ~(uint32_t)(GPTIMER_ADCTRGS_ADCC2SVAL | GPTIMER_ADCTRGS_ADCC2IVAL |
                                                     GPTIMER_ADCTRGS_ADCC2SKSEL);
        GPTIMER_ADCTRGS(timer_periph) |= (uint32_t)(((value & TRIGGER_ADC_SKIPPING_VALUE_MASK) << 20) |
                                                    ((initial_value & TRIGGER_ADC_SKIPPING_VALUE_MASK) << 24) | ((skipping_source << 16) & GPTIMER_ADCTRGS_ADCC2SKSEL));
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  select trigger adc skipping function (API_ID(0x0053U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  compare:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_COMPARE1: select GPTIMERx_ADCCR1 ADTCV1
       \arg       GPTIMER_ADC_COMPARE2: select GPTIMERx_ADCCR2 ADTCV2
    \param[in]  skipping_time:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_REQ_NO: do not skipping
       \arg       GPTIMER_ADC_REQ_CNT1_ZERO: adc req source when skipping counter 1 equal 0
       \arg       GPTIMER_ADC_REQ_CNT2_ZERO: adc req source when skipping counter 2 equal 0
       \arg       GPTIMER_ADC_REQ_CNT1_OR_CNT2_ZERO: adc req source when skipping counter 1/2 equal 0
       \arg       GPTIMER_ADC_REQ_CNT1_SVAL: adc req source when skipping counter 1 equal skipping value
       \arg       GPTIMER_ADC_REQ_CNT2_SVAL: adc req source when skipping counter 2 equal skipping value
       \arg       GPTIMER_ADC_REQ_CNT1_OR_CNT2_SVAL: adc req source when skipping counter 1/2 equal skipping value
    \param[out] none
    \retval     none
*/
void gptimer_trigger_adc_skipping_time_select(uint32_t timer_periph, uint32_t compare,  uint32_t skipping_time)
{
    switch(compare) {
    case GPTIMER_ADC_COMPARE1:
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADTCV1SSEL;
        GPTIMER_ADCTL(timer_periph) |= (uint32_t)(skipping_time & GPTIMER_ADCTL_ADTCV1SSEL);
        break;
    case GPTIMER_ADC_COMPARE2:
        GPTIMER_ADCTL(timer_periph) &= ~(uint32_t)GPTIMER_ADCTL_ADTCV2SSEL;
        GPTIMER_ADCTL(timer_periph) |= (uint32_t)((skipping_time << 4) & GPTIMER_ADCTL_ADTCV2SSEL);
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  read trigger adc skipping counter (API_ID(0x0054U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_count:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADC_SKIP_COUNT1: adc skipping counter 1
       \arg       GPTIMER_ADC_SKIP_COUNT2: adc skipping counter 2
    \param[out] none
    \retval     skipping counter
*/
uint16_t gptimer_trigger_adc_skipping_counter_read(uint32_t timer_periph, uint32_t skipping_count)
{
    uint16_t skipping_counter;
    switch(skipping_count) {
    case GPTIMER_ADC_SKIP_COUNT1:
        skipping_counter = (uint16_t)(((GPTIMER_ADCTRGS(timer_periph))&GPTIMER_ADCTRGS_ADCC1VAL) >> 12);
        break;
    case GPTIMER_ADC_SKIP_COUNT2:
        skipping_counter = (uint16_t)(((GPTIMER_ADCTRGS(timer_periph))&GPTIMER_ADCTRGS_ADCC2VAL) >> 28);
        break;
    default:
        /*illegal  parameter */
        break;
    }
    return skipping_counter;
}

/*!
    \brief  config additional interrupt skipping initial value (API_ID(0x0055U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_count:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADDINT_SKIP_COUNT1: additional interrupt skipping counter 1
       \arg       GPTIMER_ADDINT_SKIP_COUNT2: additional interrupt skipping counter 2
    \param[in]  value: skipping value, 0~15
    \param[in]  initial_value: initial value, 0~15
    \param[in]  skipping_source:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADDINT_SKIP_NO: no additional interrupt skipping counter source
       \arg       GPTIMER_ADDINT_SKIP_OVERFLOW: overflow as additional skipping counter source
       \arg       GPTIMER_ADDINT_SKIP_UNDERFLOW: underflow as additional skipping counter source
       \arg       GPTIMER_ADDINT_SKIP_FLOW: overflow and underflow as additional skipping counter source
    \param[out] none
    \retval     none
*/
void gptimer_additional_interrupt_skipping_config(uint32_t timer_periph, uint32_t skipping_count, uint32_t value,
                                                  uint32_t initial_value, uint32_t skipping_source)
{
    switch(skipping_count) {
    case GPTIMER_ADDINT_SKIP_COUNT1:
        GPTIMER_ADDINTSCTL0(timer_periph) &= ~(uint32_t)(GPTIMER_ADDINTSCTL0_ADDC1SVAL | GPTIMER_ADDINTSCTL0_ADDC1IVAL |
                                                         GPTIMER_ADDINTSCTL0_ADDC1SKSEL);
        GPTIMER_ADDINTSCTL0(timer_periph) |= (uint32_t)(((initial_value & TRIGGER_ADD_SKIPPING_VALUE_MASK) << 8) |
                                                        ((value & TRIGGER_ADD_SKIPPING_VALUE_MASK) << 4) | (skipping_source & GPTIMER_ADDINTSCTL0_ADDC1SKSEL));
        break;
    case GPTIMER_ADDINT_SKIP_COUNT2:
        GPTIMER_ADDINTSCTL0(timer_periph) &= ~(uint32_t)(GPTIMER_ADDINTSCTL0_ADDC2SVAL | GPTIMER_ADDINTSCTL0_ADDC2IVAL |
                                                         GPTIMER_ADDINTSCTL0_ADDC2SKSEL);
        GPTIMER_ADDINTSCTL0(timer_periph) |= (uint32_t)(((initial_value & TRIGGER_ADD_SKIPPING_VALUE_MASK) << 24) |
                                                        ((value & TRIGGER_ADD_SKIPPING_VALUE_MASK) << 20) | ((skipping_source << 16) & GPTIMER_ADDINTSCTL0_ADDC2SKSEL));
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  select additional interrupt skipping function (API_ID(0x0056U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  event:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADDINT_SKIP_EVENT_CH0CV: additional interrupt skipping event ch0cv
       \arg       GPTIMER_ADDINT_SKIP_EVENT_CH1CV: additional interrupt skipping event ch1cv
       \arg       GPTIMER_ADDINT_SKIP_EVENT_CH0COMV_ADD: additional interrupt skipping event ch0comv_add
       \arg       GPTIMER_ADDINT_SKIP_EVENT_CH1COMV_ADD: additional interrupt skipping event ch1comv_add
       \arg       GPTIMER_ADDINT_SKIP_EVENT_UNDERFLOW: additional interrupt skipping event underflow
       \arg       GPTIMER_ADDINT_SKIP_EVENT_OVERFLOW: additional interrupt skipping event overflow
       \arg       GPTIMER_ADDINT_SKIP_EVENT_ADTCV1: additional interrupt skipping event adtcv1
       \arg       GPTIMER_ADDINT_SKIP_EVENT_ADTCV2: additional interrupt skipping event adtcv2
    \param[in]  skipping_time:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADDINT_REQ_NO: do not skipping
       \arg       GPTIMER_ADDINT_REQ_CNT1_ZERO: additional interrupt req source when skipping counter 1 equal 0
       \arg       GPTIMER_ADDINT_REQ_CNT2_ZERO: additional interrupt req source when skipping counter 2 equal 0
       \arg       GPTIMER_ADDINT_REQ_CNT1_OR_CNT2_ZERO: additional interrupt req source when skipping counter 1/2 equal 0
       \arg       GPTIMER_ADDINT_REQ_CNT1_SVAL: additional interrupt req source when skipping counter 1 equal skipping value
       \arg       GPTIMER_ADDINT_REQ_CNT2_SVAL: additional interrupt req source when skipping counter 2 equal skipping value
       \arg       GPTIMER_ADDINT_REQ_CNT1_OR_CNT2_SVAL: additional interrupt req source when skipping counter 1/2 equal skipping value
    \param[out] none
    \retval     none
*/
void gptimer_additional_interrupt_skipping_time_select(uint32_t timer_periph, uint32_t event,  uint32_t skipping_time)
{
    switch(event) {
    case GPTIMER_ADDINT_SKIP_EVENT_CH0CV:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_CH0AISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)(skipping_time & SKIPPING_TIME_MASK);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_CH1CV:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_CH1AISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 4);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_CH0COMV_ADD:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_CH0ADDAISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 8);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_CH1COMV_ADD:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_CH1ADDAISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 12);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_UNDERFLOW:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_UFAISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 16);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_OVERFLOW:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_OFAISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 20);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_ADTCV1:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_ADT1AISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 24);
        break;
    case GPTIMER_ADDINT_SKIP_EVENT_ADTCV2:
        GPTIMER_ADDINTSCTL1(timer_periph) &= ~(uint32_t)GPTIMER_ADDINTSCTL1_ADT2AISSEL;
        GPTIMER_ADDINTSCTL1(timer_periph) |= (uint32_t)((skipping_time & SKIPPING_TIME_MASK) << 28);
        break;
    default:
        /*illegal  parameter */
        break;
    }
}

/*!
    \brief  read additional interrupt skipping counter (API_ID(0x0057U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_count:
                only one parameter can be selected which is shown as below:
       \arg       GPTIMER_ADDINT_SKIP_COUNT1: additional interrupt skipping counter 1
       \arg       GPTIMER_ADDINT_SKIP_COUNT2: additional interrupt skipping counter 2
    \param[out] none
    \retval     skipping counter
*/
uint16_t gptimer_additional_interrupt_skipping_counter_read(uint32_t timer_periph, uint32_t skipping_count)
{
    uint16_t skipping_counter;
    switch(skipping_count) {
    case GPTIMER_ADDINT_SKIP_COUNT1:
        skipping_counter = (uint16_t)(((GPTIMER_ADDINTSCTL0(timer_periph))&GPTIMER_ADDINTSCTL0_ADDC1VAL) >> 12);
        break;
    case GPTIMER_ADDINT_SKIP_COUNT2:
        skipping_counter = (uint16_t)(((GPTIMER_ADDINTSCTL0(timer_periph))&GPTIMER_ADDINTSCTL0_ADDC2VAL) >> 28);
        break;
    default:
        /*illegal  parameter */
        break;
    }
    return skipping_counter;
}

/*!
    \brief      select flow interrupt skipping source (API_ID(0x0058U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_source:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_FLOW_SKIP_SOURCE_NO: no flow skipping
      \arg        GPTIMER_FLOW_SKIP_SOURCE_OVERFLOW: overflow as flow skipping source
      \arg        GPTIMER_FLOW_SKIP_SOURCE_UNDERFLOW: underflow as flow skipping source
      \arg        GPTIMER_FLOW_SKIP_SOURCE_FLOW: overflow / underflow as flow skipping source
    \param[out] none
    \retval     none
*/
void gptimer_flow_interrupt_skipping_source_select(uint32_t timer_periph, uint32_t skipping_source)
{
    GPTIMER_IADCTSS(timer_periph) &= ~(uint32_t)(GPTIMER_IADCTSS_OUFINTSSEL);
    GPTIMER_IADCTSS(timer_periph) |= (uint32_t)(skipping_source & GPTIMER_IADCTSS_OUFINTSSEL);
}

/*!
    \brief      enable flow interrupt skipping link function (API_ID(0x0059U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_link_source:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_SKIP_LINK_CH0CV: interrupt skipping link channel 0 input capture/compare match
      \arg        GPTIMER_SKIP_LINK_CH1CV: interrupt skipping link channel 1 input capture/compare match
      \arg        GPTIMER_SKIP_LINK_CH0COMV_ADD: interrupt skipping link channel 0 additional value compare match
      \arg        GPTIMER_SKIP_LINK_CH1COMV_ADD: interrupt skipping link channel 1 additional value compare match
      \arg        GPTIMER_SKIP_LINK_ADCCR1: interrupt skipping link trigger signal generated by ADTCV1[15:0]
      \arg        GPTIMER_SKIP_LINK_ADCCR2: interrupt skipping link trigger signal generated by ADTCV2[15:0]
    \param[out] none
    \retval     none
*/
void gptimer_flow_interrupt_skipping_link_enable(uint32_t timer_periph, uint32_t skipping_link_source)
{
    GPTIMER_IADCTSS(timer_periph) |= (uint32_t)(skipping_link_source & FLOW_SKIPPING_LINK_MASK);
}

/*!
    \brief      disable flow interrupt skipping link function (API_ID(0x005AU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  skipping_link_source:
                one or more parameter can be selected which is shown as below:
      \arg        GPTIMER_SKIP_LINK_CH0CV: interrupt skipping link channel 0 input capture/compare match
      \arg        GPTIMER_SKIP_LINK_CH1CV: interrupt skipping link channel 1 input capture/compare match
      \arg        GPTIMER_SKIP_LINK_CH0COMV_ADD: interrupt skipping link channel 0 additional value compare match
      \arg        GPTIMER_SKIP_LINK_CH1COMV_ADD: interrupt skipping link channel 1 additional value compare match
      \arg        GPTIMER_SKIP_LINK_ADCCR1: interrupt skipping link trigger signal generated by ADTCV1[15:0]
      \arg        GPTIMER_SKIP_LINK_ADCCR2: interrupt skipping link trigger signal generated by ADTCV2[15:0]
    \param[out] none
    \retval     none
*/
void gptimer_flow_interrupt_skipping_link_disable(uint32_t timer_periph, uint32_t skipping_link_source)
{
    GPTIMER_IADCTSS(timer_periph) &= ~(uint32_t)(skipping_link_source & FLOW_SKIPPING_LINK_MASK);
}

/*!
    \brief      configure flow interrupt repetition skipping number (API_ID(0x005BU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  number: the interrupt skipping value, 0~7
    \param[out] none
    \retval     none
*/
void gptimer_flow_interrupt_skipping_num_config(uint32_t timer_periph, uint32_t number)
{
    GPTIMER_IADCTSS(timer_periph) &= ~(uint32_t)(GPTIMER_IADCTSS_OUFINTSVAL);
    GPTIMER_IADCTSS(timer_periph) |= (uint32_t)((number << 8) & GPTIMER_IADCTSS_OUFINTSVAL);
}

/*!
    \brief      read flow interrupt skipping counter value (API_ID(0x005CU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[out] none
    \retval     skipping counter
*/
uint16_t gptimer_flow_interrupt_skipping_counter_read(uint32_t timer_periph)
{
    uint16_t skipping_counter = 0U;
    skipping_counter = (uint16_t)(((GPTIMER_IADCTSS(timer_periph))&GPTIMER_IADCTSS_OUFINTSC) >> 16);
    return skipping_counter;
}

/*!
    \brief      configure write CHxVAL register selection (API_ID(0x005DU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  ccsel:
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_CHVSEL_DISABLE: no effect
      \arg        GPTIMER_CHVSEL_ENABLE: when write the CHxVAL register, if the write value is same as the CHxVAL value, the write access is ignored
    \param[out] none
    \retval     none
*/
void gptimer_write_chxval_register_config(uint32_t timer_periph, uint16_t ccsel)
{
    if(GPTIMER_CHVSEL_ENABLE == ccsel) {
        GPTIMER_CFG(timer_periph) |= (uint32_t)GPTIMER_CFG_CHVSEL;
    } else if(GPTIMER_CHVSEL_DISABLE == ccsel) {
        GPTIMER_CFG(timer_periph) &= ~(uint32_t)GPTIMER_CFG_CHVSEL;
    } else {
        /* illegal parameters */
    }
}

/*!
    \brief      get GPTIMER flags (API_ID(0x005EU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  flag: the gptimer flags
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_FLAG_CH0: GPTIMER channel 0 capture or compare flag
      \arg        GPTIMER_FLAG_CH1: GPTIMER channel 1 capture or compare flag
      \arg        GPTIMER_FLAG_OVERFLOW: GPTIMER counter overflow flag
      \arg        GPTIMER_FLAG_UNDERFLOW: GPTIMER counter underflow flag
      \arg        GPTIMER_FLAG_CH0COMADD: GPTIMER additional channel 0 compare flag
      \arg        GPTIMER_FLAG_CH1COMADD: GPTIMER additional channel 1 compare flag
      \arg        GPTIMER_FLAG_RS: GPTIMER counter reset flag
      \arg        GPTIMER_FLAG_ADT1CMU: GPTIMER adc trigger 1 up count compare match flag
      \arg        GPTIMER_FLAG_ADT1CMD: GPTIMER adc trigger 1 down count compare match flag
      \arg        GPTIMER_FLAG_ADT2CMU: GPTIMER adc trigger 2 up count compare match flag
      \arg        GPTIMER_FLAG_ADT2CMD: GPTIMER adc trigger 2 down count compare match flag
      \arg        GPTIMER_FLAG_CHHOUT: GPTIMER output simultaneous high error flag
      \arg        GPTIMER_FLAG_CHLOUT: GPTIMER output simultaneous low error flag
      \arg        GPTIMER_FLAG_RCEND: GPTIMER repetition count end flag
      \arg        GPTIMER_FLAG_DIR: GPTIMER counter direction flag
      \arg        GPTIMER_FLAG_OST: GPTIMER output stop flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus gptimer_flag_get(uint32_t timer_periph, uint32_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (GPTIMER_INTF(timer_periph) & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear GPTIMER flags (API_ID(0x005FU))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  flag: the gptimer flags
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_FLAG_CH0: GPTIMER channel 0 capture or compare flag
      \arg        GPTIMER_FLAG_CH1: GPTIMER channel 1 capture or compare flag
      \arg        GPTIMER_FLAG_OVERFLOW: GPTIMER counter overflow flag
      \arg        GPTIMER_FLAG_UNDERFLOW: GPTIMER counter underflow flag
      \arg        GPTIMER_FLAG_CH0COMADD: GPTIMER additional channel 0 compare flag
      \arg        GPTIMER_FLAG_CH1COMADD: GPTIMER additional channel 1 compare flag
      \arg        GPTIMER_FLAG_RS: GPTIMER counter reset flag
      \arg        GPTIMER_FLAG_ADT1CMU: GPTIMER adc trigger 1 up count compare match flag
      \arg        GPTIMER_FLAG_ADT1CMD: GPTIMER adc trigger 1 down count compare match flag
      \arg        GPTIMER_FLAG_ADT2CMU: GPTIMER adc trigger 2 up count compare match flag
      \arg        GPTIMER_FLAG_ADT2CMD: GPTIMER adc trigger 2 down count compare match flag
      \arg        GPTIMER_FLAG_CHHOUT: GPTIMER output simultaneous high error flag
      \arg        GPTIMER_FLAG_CHLOUT: GPTIMER output simultaneous low error flag
      \arg        GPTIMER_FLAG_RCEND: GPTIMER repetition count end flag
      \arg        GPTIMER_FLAG_DIR: GPTIMER counter direction flag
      \arg        GPTIMER_FLAG_OST: GPTIMER output stop flag
    \param[out] none
    \retval     none
*/
void gptimer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    GPTIMER_INTF(timer_periph) = (~(uint32_t)flag);
}

/*!
    \brief      enable the GPTIMER interrupt (API_ID(0x0060U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  interrupt: gptimer interrupt enable source
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_INT_CH0: GPTIMER channel 1 capture or compare interrupt
      \arg        GPTIMER_INT_CH1: GPTIMER channel 2 capture or compare interrupt
      \arg        GPTIMER_INT_OVERFLOW: GPTIMER counter overflow interrupt
      \arg        GPTIMER_INT_UNDERFLOW: GPTIMER counter underflow interrupt
      \arg        GPTIMER_INT_CH0COMADD: GPTIMER additional channel 1 compare interrupt
      \arg        GPTIMER_INT_CH1COMADD: GPTIMER additional channel 2 compare interrupt
      \arg        GPTIMER_INT_RS: GPTIMER counter reset interrupt
      \arg        GPTIMER_INT_CREP: GPTIMER repetition count end interrupt
    \param[out] none
    \retval     none
*/
void gptimer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    GPTIMER_DMAINTEN(timer_periph) |= (uint32_t)(interrupt & INTERRUPT_ENABLE_MASK);
}

