burakenez/gd32m53x-cmake-vscode/Drivers/GD32M53x_standard_peripheral/Source/gd32m53x_gptimer.c
/*!
    \brief      disable the GPTIMER interrupt (API_ID(0x0061U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  interrupt: gptimer interrupt enable source
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_INT_CH0: GPTIMER channel 1 capture or compare interrupt
      \arg        GPTIMER_INT_CH1: GPTIMER channel 2 capture or compare interrupt
      \arg        GPTIMER_INT_OVERFLOW: GPTIMER counter overflow interrupt
      \arg        GPTIMER_INT_UNDERFLOW: GPTIMER counter underflow interrupt
      \arg        GPTIMER_INT_CH0COMADD: GPTIMER additional channel 1 compare interrupt
      \arg        GPTIMER_INT_CH1COMADD: GPTIMER additional channel 2 compare interrupt
      \arg        GPTIMER_INT_RS: GPTIMER counter reset interrupt
      \arg        GPTIMER_INT_CREP: GPTIMER repetition count end interrupt
    \param[out] none
    \retval     none
*/
void gptimer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    GPTIMER_DMAINTEN(timer_periph) &= (~(uint32_t)(interrupt & INTERRUPT_ENABLE_MASK));
}

/*!
    \brief      get gptimer interrupt flag (API_ID(0x0062U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  int_flag: the gptimer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_INT_FLAG_CH0: GPTIMER channel 0 capture or compare interrupt flag
      \arg        GPTIMER_INT_FLAG_CH1: GPTIMER channel 1 capture or compare interrupt flag
      \arg        GPTIMER_INT_FLAG_OVERFLOW: GPTIMER counter overflow interrupt flag
      \arg        GPTIMER_INT_FLAG_UNDERFLOW: GPTIMER counter underflow interrupt flag
      \arg        GPTIMER_INT_FLAG_CH0COMADD: GPTIMER additional channel 0 compare interrupt flag
      \arg        GPTIMER_INT_FLAG_CH1COMADD: GPTIMER additional channel 1 compare interrupt flag
      \arg        GPTIMER_INT_FLAG_RS: GPTIMER counter reset interrupt flag
      \arg        GPTIMER_INT_FLAG_CREP: GPTIMER repetition count end interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus gptimer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    FlagStatus reval = RESET;
    uint32_t val;
    val = (GPTIMER_DMAINTEN(timer_periph) & int_flag);
    if((RESET != (GPTIMER_INTF(timer_periph) & int_flag)) && (RESET != val)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear gptimer interrupt flag (API_ID(0x0063U))
    \param[in]  timer_periph: GPTIMERx(x=0,1)
    \param[in]  int_flag: the gptimer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        GPTIMER_INT_FLAG_CH0: GPTIMER channel 0 capture or compare interrupt flag
      \arg        GPTIMER_INT_FLAG_CH1: GPTIMER channel 1 capture or compare interrupt flag
      \arg        GPTIMER_INT_FLAG_OVERFLOW: GPTIMER counter overflow interrupt flag
      \arg        GPTIMER_INT_FLAG_UNDERFLOW: GPTIMER counter underflow interrupt flag
      \arg        GPTIMER_INT_FLAG_CH0COMADD: GPTIMER additional channel 0 compare interrupt flag
      \arg        GPTIMER_INT_FLAG_CH1COMADD: GPTIMER additional channel 1 compare interrupt flag
      \arg        GPTIMER_INT_FLAG_RS: GPTIMER counter reset interrupt flag
      \arg        GPTIMER_INT_FLAG_CREP: GPTIMER repetition count end interrupt flag
    \param[out] none
    \retval     none
*/
void gptimer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag)
{
    GPTIMER_INTF(timer_periph) = (~(uint32_t)(int_flag & INTERRUPT_FLAG_MASK));
}
